ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M460/PeripheralPins.c
/*
 * Copyright (c) 2022, Nuvoton Technology Corporation
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include "PeripheralPins.h"

//*** ADC ***

const PinMap PinMap_ADC[] = {
    {PA_8, ADC_1_4, SYS_GPA_MFP2_PA8MFP_EADC1_CH4},
    {NU_PINNAME_BIND(PA_8, ADC_1_4), ADC_1_4, SYS_GPA_MFP2_PA8MFP_EADC1_CH4},
    {PA_8, ADC_2_4, SYS_GPA_MFP2_PA8MFP_EADC2_CH4},
    {NU_PINNAME_BIND(PA_8, ADC_2_4), ADC_2_4, SYS_GPA_MFP2_PA8MFP_EADC2_CH4},
    {PA_9, ADC_1_5, SYS_GPA_MFP2_PA9MFP_EADC1_CH5},
    {NU_PINNAME_BIND(PA_9, ADC_1_5), ADC_1_5, SYS_GPA_MFP2_PA9MFP_EADC1_CH5},
    {PA_9, ADC_2_5, SYS_GPA_MFP2_PA9MFP_EADC2_CH5},
    {NU_PINNAME_BIND(PA_9, ADC_2_5), ADC_2_5, SYS_GPA_MFP2_PA9MFP_EADC2_CH5},
    {PA_10, ADC_1_6, SYS_GPA_MFP2_PA10MFP_EADC1_CH6},
    {NU_PINNAME_BIND(PA_10, ADC_1_6), ADC_1_6, SYS_GPA_MFP2_PA10MFP_EADC1_CH6},
    {PA_10, ADC_2_6, SYS_GPA_MFP2_PA10MFP_EADC2_CH6},
    {NU_PINNAME_BIND(PA_10, ADC_2_6), ADC_2_6, SYS_GPA_MFP2_PA10MFP_EADC2_CH6},
    {PA_11, ADC_1_7, SYS_GPA_MFP2_PA11MFP_EADC1_CH7},
    {NU_PINNAME_BIND(PA_11, ADC_1_7), ADC_1_7, SYS_GPA_MFP2_PA11MFP_EADC1_CH7},
    {PA_11, ADC_2_7, SYS_GPA_MFP2_PA11MFP_EADC2_CH7},
    {NU_PINNAME_BIND(PA_11, ADC_2_7), ADC_2_7, SYS_GPA_MFP2_PA11MFP_EADC2_CH7},
    {PB_0, ADC_0_0, SYS_GPB_MFP0_PB0MFP_EADC0_CH0},
    {NU_PINNAME_BIND(PB_0, ADC_0_0), ADC_0_0, SYS_GPB_MFP0_PB0MFP_EADC0_CH0},
    {PB_0, ADC_1_8, SYS_GPB_MFP0_PB0MFP_EADC1_CH8},
    {NU_PINNAME_BIND(PB_0, ADC_1_8), ADC_1_8, SYS_GPB_MFP0_PB0MFP_EADC1_CH8},
    {PB_0, ADC_2_8, SYS_GPB_MFP0_PB0MFP_EADC2_CH8},
    {NU_PINNAME_BIND(PB_0, ADC_2_8), ADC_2_8, SYS_GPB_MFP0_PB0MFP_EADC2_CH8},
    {PB_1, ADC_0_1, SYS_GPB_MFP0_PB1MFP_EADC0_CH1},
    {NU_PINNAME_BIND(PB_1, ADC_0_1), ADC_0_1, SYS_GPB_MFP0_PB1MFP_EADC0_CH1},
    {PB_1, ADC_1_9, SYS_GPB_MFP0_PB1MFP_EADC1_CH9},
    {NU_PINNAME_BIND(PB_1, ADC_1_9), ADC_1_9, SYS_GPB_MFP0_PB1MFP_EADC1_CH9},
    {PB_1, ADC_2_9, SYS_GPB_MFP0_PB1MFP_EADC2_CH9},
    {NU_PINNAME_BIND(PB_1, ADC_2_9), ADC_2_9, SYS_GPB_MFP0_PB1MFP_EADC2_CH9},
    {PB_2, ADC_0_2, SYS_GPB_MFP0_PB2MFP_EADC0_CH2},
    {NU_PINNAME_BIND(PB_2, ADC_0_2), ADC_0_2, SYS_GPB_MFP0_PB2MFP_EADC0_CH2},
    {PB_2, ADC_1_10, SYS_GPB_MFP0_PB2MFP_EADC1_CH10},
    {NU_PINNAME_BIND(PB_2, ADC_1_10), ADC_1_10, SYS_GPB_MFP0_PB2MFP_EADC1_CH10},
    {PB_3, ADC_0_3, SYS_GPB_MFP0_PB3MFP_EADC0_CH3},
    {NU_PINNAME_BIND(PB_3, ADC_0_3), ADC_0_3, SYS_GPB_MFP0_PB3MFP_EADC0_CH3},
    {PB_3, ADC_1_11, SYS_GPB_MFP0_PB3MFP_EADC1_CH11},
    {NU_PINNAME_BIND(PB_3, ADC_1_11), ADC_1_11, SYS_GPB_MFP0_PB3MFP_EADC1_CH11},
    {PB_4, ADC_0_4, SYS_GPB_MFP1_PB4MFP_EADC0_CH4},
    {PB_5, ADC_0_5, SYS_GPB_MFP1_PB5MFP_EADC0_CH5},
    {PB_6, ADC_0_6, SYS_GPB_MFP1_PB6MFP_EADC0_CH6},
    {NU_PINNAME_BIND(PB_6, ADC_0_6), ADC_0_6, SYS_GPB_MFP1_PB6MFP_EADC0_CH6},
    {PB_6, ADC_2_14, SYS_GPB_MFP1_PB6MFP_EADC2_CH14},
    {NU_PINNAME_BIND(PB_6, ADC_2_14), ADC_2_14, SYS_GPB_MFP1_PB6MFP_EADC2_CH14},
    {PB_7, ADC_0_7, SYS_GPB_MFP1_PB7MFP_EADC0_CH7},
    {NU_PINNAME_BIND(PB_7, ADC_0_7), ADC_0_7, SYS_GPB_MFP1_PB7MFP_EADC0_CH7},
    {PB_7, ADC_2_15, SYS_GPB_MFP1_PB7MFP_EADC2_CH15},
    {NU_PINNAME_BIND(PB_7, ADC_2_15), ADC_2_15, SYS_GPB_MFP1_PB7MFP_EADC2_CH15},
    {PB_8, ADC_0_8, SYS_GPB_MFP2_PB8MFP_EADC0_CH8},
    {PB_9, ADC_0_9, SYS_GPB_MFP2_PB9MFP_EADC0_CH9},
    {PB_10, ADC_0_10, SYS_GPB_MFP2_PB10MFP_EADC0_CH10},
    {PB_11, ADC_0_11, SYS_GPB_MFP2_PB11MFP_EADC0_CH11},
    {PB_12, ADC_0_12, SYS_GPB_MFP3_PB12MFP_EADC0_CH12},
    {NU_PINNAME_BIND(PB_12, ADC_0_12), ADC_0_12, SYS_GPB_MFP3_PB12MFP_EADC0_CH12},
    {PB_12, ADC_1_12, SYS_GPB_MFP3_PB12MFP_EADC1_CH12},
    {NU_PINNAME_BIND(PB_12, ADC_1_12), ADC_1_12, SYS_GPB_MFP3_PB12MFP_EADC1_CH12},
    {PB_13, ADC_0_13, SYS_GPB_MFP3_PB13MFP_EADC0_CH13},
    {NU_PINNAME_BIND(PB_13, ADC_0_13), ADC_0_13, SYS_GPB_MFP3_PB13MFP_EADC0_CH13},
    {PB_13, ADC_1_13, SYS_GPB_MFP3_PB13MFP_EADC1_CH13},
    {NU_PINNAME_BIND(PB_13, ADC_1_13), ADC_1_13, SYS_GPB_MFP3_PB13MFP_EADC1_CH13},
    {PB_14, ADC_0_14, SYS_GPB_MFP3_PB14MFP_EADC0_CH14},
    {NU_PINNAME_BIND(PB_14, ADC_0_14), ADC_0_14, SYS_GPB_MFP3_PB14MFP_EADC0_CH14},
    {PB_14, ADC_1_14, SYS_GPB_MFP3_PB14MFP_EADC1_CH14},
    {NU_PINNAME_BIND(PB_14, ADC_1_14), ADC_1_14, SYS_GPB_MFP3_PB14MFP_EADC1_CH14},
    {PB_15, ADC_0_15, SYS_GPB_MFP3_PB15MFP_EADC0_CH15},
    {NU_PINNAME_BIND(PB_15, ADC_0_15), ADC_0_15, SYS_GPB_MFP3_PB15MFP_EADC0_CH15},
    {PB_15, ADC_1_15, SYS_GPB_MFP3_PB15MFP_EADC1_CH15},
    {NU_PINNAME_BIND(PB_15, ADC_1_15), ADC_1_15, SYS_GPB_MFP3_PB15MFP_EADC1_CH15},
    {PC_9, ADC_2_10, SYS_GPC_MFP2_PC9MFP_EADC2_CH10},
    {PC_10, ADC_2_11, SYS_GPC_MFP2_PC10MFP_EADC2_CH11},
    {PC_11, ADC_2_12, SYS_GPC_MFP2_PC11MFP_EADC2_CH12},
    {PC_12, ADC_2_13, SYS_GPC_MFP3_PC12MFP_EADC2_CH13},
    {PC_13, ADC_1_3, SYS_GPC_MFP3_PC13MFP_EADC1_CH3},
    {NU_PINNAME_BIND(PC_13, ADC_1_3), ADC_1_3, SYS_GPC_MFP3_PC13MFP_EADC1_CH3},
    {PC_13, ADC_2_3, SYS_GPC_MFP3_PC13MFP_EADC2_CH3},
    {NU_PINNAME_BIND(PC_13, ADC_2_3), ADC_2_3, SYS_GPC_MFP3_PC13MFP_EADC2_CH3},
    {PD_10, ADC_1_0, SYS_GPD_MFP2_PD10MFP_EADC1_CH0},
    {NU_PINNAME_BIND(PD_10, ADC_1_0), ADC_1_0, SYS_GPD_MFP2_PD10MFP_EADC1_CH0},
    {PD_10, ADC_2_0, SYS_GPD_MFP2_PD10MFP_EADC2_CH0},
    {NU_PINNAME_BIND(PD_10, ADC_2_0), ADC_2_0, SYS_GPD_MFP2_PD10MFP_EADC2_CH0},
    {PD_11, ADC_1_1, SYS_GPD_MFP2_PD11MFP_EADC1_CH1},
    {NU_PINNAME_BIND(PD_11, ADC_1_1), ADC_1_1, SYS_GPD_MFP2_PD11MFP_EADC1_CH1},
    {PD_11, ADC_2_1, SYS_GPD_MFP2_PD11MFP_EADC2_CH1},
    {NU_PINNAME_BIND(PD_11, ADC_2_1), ADC_2_1, SYS_GPD_MFP2_PD11MFP_EADC2_CH1},
    {PD_12, ADC_1_2, SYS_GPD_MFP3_PD12MFP_EADC1_CH2},
    {NU_PINNAME_BIND(PD_12, ADC_1_2), ADC_1_2, SYS_GPD_MFP3_PD12MFP_EADC1_CH2},
    {PD_12, ADC_2_2, SYS_GPD_MFP3_PD12MFP_EADC2_CH2},
    {NU_PINNAME_BIND(PD_12, ADC_2_2), ADC_2_2, SYS_GPD_MFP3_PD12MFP_EADC2_CH2},

    {NC,   NC,    0}
};

//*** DAC ***

const PinMap PinMap_DAC[] = {
    {PB_12, DAC_0_0, SYS_GPB_MFP3_PB12MFP_DAC0_OUT},
    {PB_13, DAC_1_0, SYS_GPB_MFP3_PB13MFP_DAC1_OUT},

    {NC,   NC,    0}
};

//*** I2C ***

const PinMap PinMap_I2C_SDA[] = {
    {PA_0, I2C_2, SYS_GPA_MFP0_PA0MFP_I2C2_SDA},
    {PA_2, I2C_1, SYS_GPA_MFP0_PA2MFP_I2C1_SDA},
    {PA_4, I2C_0, SYS_GPA_MFP1_PA4MFP_I2C0_SDA},
    {PA_6, I2C_1, SYS_GPA_MFP1_PA6MFP_I2C1_SDA},
    {PA_10, I2C_2, SYS_GPA_MFP2_PA10MFP_I2C2_SDA},
    {PA_13, I2C_1, SYS_GPA_MFP3_PA13MFP_I2C1_SDA},
    {PA_15, I2C_0, SYS_GPA_MFP3_PA15MFP_I2C0_SDA},
    {NU_PINNAME_BIND(PA_15, I2C_0), I2C_0, SYS_GPA_MFP3_PA15MFP_I2C0_SDA},
    {PA_15, I2C_2, SYS_GPA_MFP3_PA15MFP_I2C2_SDA},
    {NU_PINNAME_BIND(PA_15, I2C_2), I2C_2, SYS_GPA_MFP3_PA15MFP_I2C2_SDA},
    {PB_0, I2C_1, SYS_GPB_MFP0_PB0MFP_I2C1_SDA},
    {PB_2, I2C_1, SYS_GPB_MFP0_PB2MFP_I2C1_SDA},
    {PB_4, I2C_0, SYS_GPB_MFP1_PB4MFP_I2C0_SDA},
    {PB_8, I2C_0, SYS_GPB_MFP2_PB8MFP_I2C0_SDA},
    {PB_10, I2C_1, SYS_GPB_MFP2_PB10MFP_I2C1_SDA},
    {PB_12, I2C_2, SYS_GPB_MFP3_PB12MFP_I2C2_SDA},
    {PC_0, I2C_0, SYS_GPC_MFP0_PC0MFP_I2C0_SDA},
    {PC_2, I2C_3, SYS_GPC_MFP0_PC2MFP_I2C3_SDA},
    {PC_4, I2C_1, SYS_GPC_MFP1_PC4MFP_I2C1_SDA},
    {PC_8, I2C_0, SYS_GPC_MFP2_PC8MFP_I2C0_SDA},
    {PC_11, I2C_0, SYS_GPC_MFP2_PC11MFP_I2C0_SDA},
    {NU_PINNAME_BIND(PC_11, I2C_0), I2C_0, SYS_GPC_MFP2_PC11MFP_I2C0_SDA},
    {PC_11, I2C_4, SYS_GPC_MFP2_PC11MFP_I2C4_SDA},
    {NU_PINNAME_BIND(PC_11, I2C_4), I2C_4, SYS_GPC_MFP2_PC11MFP_I2C4_SDA},
    {PD_0, I2C_2, SYS_GPD_MFP0_PD0MFP_I2C2_SDA},
    {PD_4, I2C_1, SYS_GPD_MFP1_PD4MFP_I2C1_SDA},
    {PD_6, I2C_0, SYS_GPD_MFP1_PD6MFP_I2C0_SDA},
    {PD_8, I2C_2, SYS_GPD_MFP2_PD8MFP_I2C2_SDA},
    {PE_0, I2C_1, SYS_GPE_MFP0_PE0MFP_I2C1_SDA},
    {PF_1, I2C_0, SYS_GPF_MFP0_PF1MFP_I2C0_SDA},
    {NU_PINNAME_BIND(PF_1, I2C_0), I2C_0, SYS_GPF_MFP0_PF1MFP_I2C0_SDA},
    {PF_1, I2C_1, SYS_GPF_MFP0_PF1MFP_I2C1_SDA},
    {NU_PINNAME_BIND(PF_1, I2C_1), I2C_1, SYS_GPF_MFP0_PF1MFP_I2C1_SDA},
    {PF_2, I2C_0, SYS_GPF_MFP0_PF2MFP_I2C0_SDA},
    {PF_4, I2C_4, SYS_GPF_MFP1_PF4MFP_I2C4_SDA},
    {PG_1, I2C_0, SYS_GPG_MFP0_PG1MFP_I2C0_SDA},
    {NU_PINNAME_BIND(PG_1, I2C_0), I2C_0, SYS_GPG_MFP0_PG1MFP_I2C0_SDA},
    {PG_1, I2C_3, SYS_GPG_MFP0_PG1MFP_I2C3_SDA},
    {NU_PINNAME_BIND(PG_1, I2C_3), I2C_3, SYS_GPG_MFP0_PG1MFP_I2C3_SDA},
    {PG_3, I2C_1, SYS_GPG_MFP0_PG3MFP_I2C1_SDA},
    {PG_8, I2C_3, SYS_GPG_MFP2_PG8MFP_I2C3_SDA},
    {PG_10, I2C_4, SYS_GPG_MFP2_PG10MFP_I2C4_SDA},
    {PH_3, I2C_0, SYS_GPH_MFP0_PH3MFP_I2C0_SDA},
    {PH_9, I2C_2, SYS_GPH_MFP2_PH9MFP_I2C2_SDA},
    {PI_7, I2C_1, SYS_GPI_MFP1_PI7MFP_I2C1_SDA},
    {PI_11, I2C_0, SYS_GPI_MFP2_PI11MFP_I2C0_SDA},
    {PI_15, I2C_3, SYS_GPI_MFP3_PI15MFP_I2C3_SDA},
    {PJ_11, I2C_4, SYS_GPJ_MFP2_PJ11MFP_I2C4_SDA},

    {NC,    NC,    0}
};

const PinMap PinMap_I2C_SCL[] = {
    {PA_1, I2C_2, SYS_GPA_MFP0_PA1MFP_I2C2_SCL},
    {PA_3, I2C_1, SYS_GPA_MFP0_PA3MFP_I2C1_SCL},
    {PA_5, I2C_0, SYS_GPA_MFP1_PA5MFP_I2C0_SCL},
    {PA_7, I2C_1, SYS_GPA_MFP1_PA7MFP_I2C1_SCL},
    {PA_11, I2C_2, SYS_GPA_MFP2_PA11MFP_I2C2_SCL},
    {PA_12, I2C_1, SYS_GPA_MFP3_PA12MFP_I2C1_SCL},
    {PA_14, I2C_0, SYS_GPA_MFP3_PA14MFP_I2C0_SCL},
    {NU_PINNAME_BIND(PA_14, I2C_0), I2C_0, SYS_GPA_MFP3_PA14MFP_I2C0_SCL},
    {PA_14, I2C_2, SYS_GPA_MFP3_PA14MFP_I2C2_SCL},
    {NU_PINNAME_BIND(PA_14, I2C_2), I2C_2, SYS_GPA_MFP3_PA14MFP_I2C2_SCL},
    {PB_1, I2C_1, SYS_GPB_MFP0_PB1MFP_I2C1_SCL},
    {PB_3, I2C_1, SYS_GPB_MFP0_PB3MFP_I2C1_SCL},
    {PB_5, I2C_0, SYS_GPB_MFP1_PB5MFP_I2C0_SCL},
    {PB_9, I2C_0, SYS_GPB_MFP2_PB9MFP_I2C0_SCL},
    {PB_11, I2C_1, SYS_GPB_MFP2_PB11MFP_I2C1_SCL},
    {PB_13, I2C_2, SYS_GPB_MFP3_PB13MFP_I2C2_SCL},
    {PC_1, I2C_0, SYS_GPC_MFP0_PC1MFP_I2C0_SCL},
    {PC_3, I2C_3, SYS_GPC_MFP0_PC3MFP_I2C3_SCL},
    {PC_5, I2C_1, SYS_GPC_MFP1_PC5MFP_I2C1_SCL},
    {PC_12, I2C_0, SYS_GPC_MFP3_PC12MFP_I2C0_SCL},
    {NU_PINNAME_BIND(PC_12, I2C_0), I2C_0, SYS_GPC_MFP3_PC12MFP_I2C0_SCL},
    {PC_12, I2C_4, SYS_GPC_MFP3_PC12MFP_I2C4_SCL},
    {NU_PINNAME_BIND(PC_12, I2C_4), I2C_4, SYS_GPC_MFP3_PC12MFP_I2C4_SCL},
    {PD_1, I2C_2, SYS_GPD_MFP0_PD1MFP_I2C2_SCL},
    {PD_5, I2C_1, SYS_GPD_MFP1_PD5MFP_I2C1_SCL},
    {PD_7, I2C_0, SYS_GPD_MFP1_PD7MFP_I2C0_SCL},
    {PD_9, I2C_2, SYS_GPD_MFP2_PD9MFP_I2C2_SCL},
    {PE_1, I2C_1, SYS_GPE_MFP0_PE1MFP_I2C1_SCL},
    {PE_13, I2C_0, SYS_GPE_MFP3_PE13MFP_I2C0_SCL},
    {PF_0, I2C_0, SYS_GPF_MFP0_PF0MFP_I2C0_SCL},
    {NU_PINNAME_BIND(PF_0, I2C_0), I2C_0, SYS_GPF_MFP0_PF0MFP_I2C0_SCL},
    {PF_0, I2C_1, SYS_GPF_MFP0_PF0MFP_I2C1_SCL},
    {NU_PINNAME_BIND(PF_0, I2C_1), I2C_1, SYS_GPF_MFP0_PF0MFP_I2C1_SCL},
    {PF_3, I2C_0, SYS_GPF_MFP0_PF3MFP_I2C0_SCL},
    {PF_5, I2C_4, SYS_GPF_MFP1_PF5MFP_I2C4_SCL},
    {PG_0, I2C_0, SYS_GPG_MFP0_PG0MFP_I2C0_SCL},
    {NU_PINNAME_BIND(PG_0, I2C_0), I2C_0, SYS_GPG_MFP0_PG0MFP_I2C0_SCL},
    {PG_0, I2C_3, SYS_GPG_MFP0_PG0MFP_I2C3_SCL},
    {NU_PINNAME_BIND(PG_0, I2C_3), I2C_3, SYS_GPG_MFP0_PG0MFP_I2C3_SCL},
    {PG_2, I2C_1, SYS_GPG_MFP0_PG2MFP_I2C1_SCL},
    {PG_7, I2C_3, SYS_GPG_MFP1_PG7MFP_I2C3_SCL},
    {PG_9, I2C_4, SYS_GPG_MFP2_PG9MFP_I2C4_SCL},
    {PH_2, I2C_0, SYS_GPH_MFP0_PH2MFP_I2C0_SCL},
    {PH_8, I2C_2, SYS_GPH_MFP2_PH8MFP_I2C2_SCL},
    {PI_6, I2C_1, SYS_GPI_MFP1_PI6MFP_I2C1_SCL},
    {PI_10, I2C_0, SYS_GPI_MFP2_PI10MFP_I2C0_SCL},
    {PI_14, I2C_3, SYS_GPI_MFP3_PI14MFP_I2C3_SCL},
    {PJ_10, I2C_4, SYS_GPJ_MFP2_PJ10MFP_I2C4_SCL},

    {NC,    NC,    0}
};

