ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M460/PeripheralPins.c
//*** PWM ***

const PinMap PinMap_PWM[] = {
    {PA_0, PWM_0_5, SYS_GPA_MFP0_PA0MFP_EPWM0_CH5},
    {PA_1, PWM_0_4, SYS_GPA_MFP0_PA1MFP_EPWM0_CH4},
    {PA_2, PWM_0_3, SYS_GPA_MFP0_PA2MFP_EPWM0_CH3},
    {PA_3, PWM_0_2, SYS_GPA_MFP0_PA3MFP_EPWM0_CH2},
    {PA_4, PWM_0_1, SYS_GPA_MFP1_PA4MFP_EPWM0_CH1},
    {PA_5, PWM_0_0, SYS_GPA_MFP1_PA5MFP_EPWM0_CH0},
    {PA_6, PWM_1_5, SYS_GPA_MFP1_PA6MFP_EPWM1_CH5},
    {PA_7, PWM_1_4, SYS_GPA_MFP1_PA7MFP_EPWM1_CH4},
    {PB_0, PWM_0_5, SYS_GPB_MFP0_PB0MFP_EPWM0_CH5},
    {NU_PINNAME_BIND(PB_0, PWM_0_5), PWM_0_5, SYS_GPB_MFP0_PB0MFP_EPWM0_CH5},
    {PB_0, PWM_1_5, SYS_GPB_MFP0_PB0MFP_EPWM1_CH5},
    {NU_PINNAME_BIND(PB_0, PWM_1_5), PWM_1_5, SYS_GPB_MFP0_PB0MFP_EPWM1_CH5},
    {PB_1, PWM_0_4, SYS_GPB_MFP0_PB1MFP_EPWM0_CH4},
    {NU_PINNAME_BIND(PB_1, PWM_0_4), PWM_0_4, SYS_GPB_MFP0_PB1MFP_EPWM0_CH4},
    {PB_1, PWM_1_4, SYS_GPB_MFP0_PB1MFP_EPWM1_CH4},
    {NU_PINNAME_BIND(PB_1, PWM_1_4), PWM_1_4, SYS_GPB_MFP0_PB1MFP_EPWM1_CH4},
    {PB_2, PWM_0_3, SYS_GPB_MFP0_PB2MFP_EPWM0_CH3},
    {PB_3, PWM_0_2, SYS_GPB_MFP0_PB3MFP_EPWM0_CH2},
    {PB_4, PWM_0_1, SYS_GPB_MFP1_PB4MFP_EPWM0_CH1},
    {PB_5, PWM_0_0, SYS_GPB_MFP1_PB5MFP_EPWM0_CH0},
    {PB_6, PWM_1_5, SYS_GPB_MFP1_PB6MFP_EPWM1_CH5},
    {PB_7, PWM_1_4, SYS_GPB_MFP1_PB7MFP_EPWM1_CH4},
    {PB_12, PWM_1_3, SYS_GPB_MFP3_PB12MFP_EPWM1_CH3},
    {PB_13, PWM_1_2, SYS_GPB_MFP3_PB13MFP_EPWM1_CH2},
    {PB_14, PWM_1_1, SYS_GPB_MFP3_PB14MFP_EPWM1_CH1},
    {PB_15, PWM_1_0, SYS_GPB_MFP3_PB15MFP_EPWM1_CH0},
    {PC_0, PWM_1_5, SYS_GPC_MFP0_PC0MFP_EPWM1_CH5},
    {PC_1, PWM_1_4, SYS_GPC_MFP0_PC1MFP_EPWM1_CH4},
    {PC_2, PWM_1_3, SYS_GPC_MFP0_PC2MFP_EPWM1_CH3},
    {PC_3, PWM_1_2, SYS_GPC_MFP0_PC3MFP_EPWM1_CH2},
    {PC_4, PWM_1_1, SYS_GPC_MFP1_PC4MFP_EPWM1_CH1},
    {PC_5, PWM_1_0, SYS_GPC_MFP1_PC5MFP_EPWM1_CH0},
    {PC_6, PWM_1_3, SYS_GPC_MFP1_PC6MFP_EPWM1_CH3},
    {PC_7, PWM_1_2, SYS_GPC_MFP1_PC7MFP_EPWM1_CH2},
    {PC_8, PWM_1_1, SYS_GPC_MFP2_PC8MFP_EPWM1_CH1},
    {PC_9, PWM_1_3, SYS_GPC_MFP2_PC9MFP_EPWM1_CH3},
    {PC_10, PWM_1_2, SYS_GPC_MFP2_PC10MFP_EPWM1_CH2},
    {PC_11, PWM_1_1, SYS_GPC_MFP2_PC11MFP_EPWM1_CH1},
    {PC_12, PWM_1_0, SYS_GPC_MFP3_PC12MFP_EPWM1_CH0},
    {PD_14, PWM_0_4, SYS_GPD_MFP3_PD14MFP_EPWM0_CH4},
    {PE_2, PWM_0_5, SYS_GPE_MFP0_PE2MFP_EPWM0_CH5},
    {PE_3, PWM_0_4, SYS_GPE_MFP0_PE3MFP_EPWM0_CH4},
    {PE_4, PWM_0_3, SYS_GPE_MFP1_PE4MFP_EPWM0_CH3},
    {PE_5, PWM_0_2, SYS_GPE_MFP1_PE5MFP_EPWM0_CH2},
    {PE_6, PWM_0_1, SYS_GPE_MFP1_PE6MFP_EPWM0_CH1},
    {PE_7, PWM_0_0, SYS_GPE_MFP1_PE7MFP_EPWM0_CH0},
    {PE_8, PWM_0_0, SYS_GPE_MFP2_PE8MFP_EPWM0_CH0},
    {PE_9, PWM_0_1, SYS_GPE_MFP2_PE9MFP_EPWM0_CH1},
    {PE_10, PWM_0_2, SYS_GPE_MFP2_PE10MFP_EPWM0_CH2},
    {PE_11, PWM_0_3, SYS_GPE_MFP2_PE11MFP_EPWM0_CH3},
    {PE_12, PWM_0_4, SYS_GPE_MFP3_PE12MFP_EPWM0_CH4},
    {PE_13, PWM_0_5, SYS_GPE_MFP3_PE13MFP_EPWM0_CH5},
    {NU_PINNAME_BIND(PE_13, PWM_0_5), PWM_0_5, SYS_GPE_MFP3_PE13MFP_EPWM0_CH5},
    {PE_13, PWM_1_0, SYS_GPE_MFP3_PE13MFP_EPWM1_CH0},
    {NU_PINNAME_BIND(PE_13, PWM_1_0), PWM_1_0, SYS_GPE_MFP3_PE13MFP_EPWM1_CH0},
    {PF_0, PWM_1_4, SYS_GPF_MFP0_PF0MFP_EPWM1_CH4},
    {PF_1, PWM_1_5, SYS_GPF_MFP0_PF1MFP_EPWM1_CH5},
    {PF_4, PWM_0_1, SYS_GPF_MFP1_PF4MFP_EPWM0_CH1},
    {PF_5, PWM_0_0, SYS_GPF_MFP1_PF5MFP_EPWM0_CH0},
    {PG_5, PWM_0_3, SYS_GPG_MFP1_PG5MFP_EPWM0_CH3},
    {PG_6, PWM_0_2, SYS_GPG_MFP1_PG6MFP_EPWM0_CH2},
    {PG_7, PWM_0_1, SYS_GPG_MFP1_PG7MFP_EPWM0_CH1},
    {PG_8, PWM_0_0, SYS_GPG_MFP2_PG8MFP_EPWM0_CH0},
    {PH_11, PWM_0_5, SYS_GPH_MFP2_PH11MFP_EPWM0_CH5},
    {PI_12, PWM_1_0, SYS_GPI_MFP3_PI12MFP_EPWM1_CH0},
    {PI_13, PWM_1_1, SYS_GPI_MFP3_PI13MFP_EPWM1_CH1},
    {PI_14, PWM_1_2, SYS_GPI_MFP3_PI14MFP_EPWM1_CH2},
    {PI_15, PWM_1_3, SYS_GPI_MFP3_PI15MFP_EPWM1_CH3},
    {PJ_0, PWM_1_4, SYS_GPJ_MFP0_PJ0MFP_EPWM1_CH4},
    {PJ_1, PWM_1_5, SYS_GPJ_MFP0_PJ1MFP_EPWM1_CH5},

    {NC,    NC,    0}
};

//*** SERIAL ***

const PinMap PinMap_UART_TX[] = {
    {PA_1, UART_0, SYS_GPA_MFP0_PA1MFP_UART0_TXD},
    {PA_3, UART_1, SYS_GPA_MFP0_PA3MFP_UART1_TXD},
    {NU_PINNAME_BIND(PA_3, UART_1), UART_1, SYS_GPA_MFP0_PA3MFP_UART1_TXD},
    {PA_3, UART_4, SYS_GPA_MFP0_PA3MFP_UART4_TXD},
    {NU_PINNAME_BIND(PA_3, UART_4), UART_4, SYS_GPA_MFP0_PA3MFP_UART4_TXD},
#if COMPONENT_FPGA_CI_TEST_SHIELD && TARGET_NUMAKER_IOT_M467
    /* Swap the sequence to pass FPGA CI Test Shield tests */
    {PA_5, UART_5, SYS_GPA_MFP1_PA5MFP_UART5_TXD},
    {NU_PINNAME_BIND(PA_5, UART_5), UART_5, SYS_GPA_MFP1_PA5MFP_UART5_TXD},
    {PA_5, UART_0, SYS_GPA_MFP1_PA5MFP_UART0_TXD},
    {NU_PINNAME_BIND(PA_5, UART_0), UART_0, SYS_GPA_MFP1_PA5MFP_UART0_TXD},
#else
    {PA_5, UART_0, SYS_GPA_MFP1_PA5MFP_UART0_TXD},
    {NU_PINNAME_BIND(PA_5, UART_0), UART_0, SYS_GPA_MFP1_PA5MFP_UART0_TXD},
    {PA_5, UART_5, SYS_GPA_MFP1_PA5MFP_UART5_TXD},
    {NU_PINNAME_BIND(PA_5, UART_5), UART_5, SYS_GPA_MFP1_PA5MFP_UART5_TXD},
#endif
    {PA_7, UART_0, SYS_GPA_MFP1_PA7MFP_UART0_TXD},
    {PA_9, UART_1, SYS_GPA_MFP2_PA9MFP_UART1_TXD},
    {NU_PINNAME_BIND(PA_9, UART_1), UART_1, SYS_GPA_MFP2_PA9MFP_UART1_TXD},
    {PA_9, UART_7, SYS_GPA_MFP2_PA9MFP_UART7_TXD},
    {NU_PINNAME_BIND(PA_9, UART_7), UART_7, SYS_GPA_MFP2_PA9MFP_UART7_TXD},
    {PA_11, UART_6, SYS_GPA_MFP2_PA11MFP_UART6_TXD},
    {PA_12, UART_4, SYS_GPA_MFP3_PA12MFP_UART4_TXD},
    {PA_14, UART_0, SYS_GPA_MFP3_PA14MFP_UART0_TXD},
    {PB_1, UART_2, SYS_GPB_MFP0_PB1MFP_UART2_TXD},
    {PB_3, UART_1, SYS_GPB_MFP0_PB3MFP_UART1_TXD},
#if COMPONENT_FPGA_CI_TEST_SHIELD && TARGET_NUMAKER_IOT_M467
    /* Swap the sequence to pass FPGA CI Test Shield tests */
    {PB_5, UART_5, SYS_GPB_MFP1_PB5MFP_UART5_TXD},
    {NU_PINNAME_BIND(PB_5, UART_5), UART_5, SYS_GPB_MFP1_PB5MFP_UART5_TXD},
    {PB_5, UART_2, SYS_GPB_MFP1_PB5MFP_UART2_TXD},
    {NU_PINNAME_BIND(PB_5, UART_2), UART_2, SYS_GPB_MFP1_PB5MFP_UART2_TXD},
#else
    {PB_5, UART_2, SYS_GPB_MFP1_PB5MFP_UART2_TXD},
    {NU_PINNAME_BIND(PB_5, UART_2), UART_2, SYS_GPB_MFP1_PB5MFP_UART2_TXD},
    {PB_5, UART_5, SYS_GPB_MFP1_PB5MFP_UART5_TXD},
    {NU_PINNAME_BIND(PB_5, UART_5), UART_5, SYS_GPB_MFP1_PB5MFP_UART5_TXD},
#endif
    {PB_7, UART_1, SYS_GPB_MFP1_PB7MFP_UART1_TXD},
    {PB_9, UART_0, SYS_GPB_MFP2_PB9MFP_UART0_TXD},
    {NU_PINNAME_BIND(PB_9, UART_0), UART_0, SYS_GPB_MFP2_PB9MFP_UART0_TXD},
    {PB_9, UART_7, SYS_GPB_MFP2_PB9MFP_UART7_TXD},
    {NU_PINNAME_BIND(PB_9, UART_7), UART_7, SYS_GPB_MFP2_PB9MFP_UART7_TXD},
    {PB_11, UART_4, SYS_GPB_MFP2_PB11MFP_UART4_TXD},
    {PB_13, UART_0, SYS_GPB_MFP3_PB13MFP_UART0_TXD},
    {PB_15, UART_3, SYS_GPB_MFP3_PB15MFP_UART3_TXD},
    {PC_1, UART_2, SYS_GPC_MFP0_PC1MFP_UART2_TXD},
    {PC_3, UART_3, SYS_GPC_MFP0_PC3MFP_UART3_TXD},
    {PC_5, UART_2, SYS_GPC_MFP1_PC5MFP_UART2_TXD},
    {NU_PINNAME_BIND(PC_5, UART_2), UART_2, SYS_GPC_MFP1_PC5MFP_UART2_TXD},
    {PC_5, UART_4, SYS_GPC_MFP1_PC5MFP_UART4_TXD},
    {NU_PINNAME_BIND(PC_5, UART_4), UART_4, SYS_GPC_MFP1_PC5MFP_UART4_TXD},
    {PC_7, UART_4, SYS_GPC_MFP1_PC7MFP_UART4_TXD},
    {NU_PINNAME_BIND(PC_7, UART_4), UART_4, SYS_GPC_MFP1_PC7MFP_UART4_TXD},
    {PC_7, UART_6, SYS_GPC_MFP1_PC7MFP_UART6_TXD},
    {NU_PINNAME_BIND(PC_7, UART_6), UART_6, SYS_GPC_MFP1_PC7MFP_UART6_TXD},
    {PC_10, UART_3, SYS_GPC_MFP2_PC10MFP_UART3_TXD},
#if COMPONENT_FPGA_CI_TEST_SHIELD && TARGET_NUMAKER_IOT_M467
    /* Swap the sequence to pass FPGA CI Test Shield tests */
    {PC_12, UART_6, SYS_GPC_MFP3_PC12MFP_UART6_TXD},
    {NU_PINNAME_BIND(PC_12, UART_6), UART_6, SYS_GPC_MFP3_PC12MFP_UART6_TXD},
    {PC_12, UART_0, SYS_GPC_MFP3_PC12MFP_UART0_TXD},
    {NU_PINNAME_BIND(PC_12, UART_0), UART_0, SYS_GPC_MFP3_PC12MFP_UART0_TXD},
#else
    {PC_12, UART_0, SYS_GPC_MFP3_PC12MFP_UART0_TXD},
    {NU_PINNAME_BIND(PC_12, UART_0), UART_0, SYS_GPC_MFP3_PC12MFP_UART0_TXD},
    {PC_12, UART_6, SYS_GPC_MFP3_PC12MFP_UART6_TXD},
    {NU_PINNAME_BIND(PC_12, UART_6), UART_6, SYS_GPC_MFP3_PC12MFP_UART6_TXD},
#endif
    {PC_13, UART_2, SYS_GPC_MFP3_PC13MFP_UART2_TXD},
    {PD_1, UART_3, SYS_GPD_MFP0_PD1MFP_UART3_TXD},
    {PD_3, UART_0, SYS_GPD_MFP0_PD3MFP_UART0_TXD},
    {PD_7, UART_1, SYS_GPD_MFP1_PD7MFP_UART1_TXD},
    {PD_9, UART_7, SYS_GPD_MFP2_PD9MFP_UART7_TXD},
    {PD_11, UART_1, SYS_GPD_MFP2_PD11MFP_UART1_TXD},
    {NU_PINNAME_BIND(PD_11, UART_1), UART_1, SYS_GPD_MFP2_PD11MFP_UART1_TXD},
    {PD_11, UART_8, SYS_GPD_MFP2_PD11MFP_UART8_TXD},
    {NU_PINNAME_BIND(PD_11, UART_8), UART_8, SYS_GPD_MFP2_PD11MFP_UART8_TXD},
    {PE_1, UART_3, SYS_GPE_MFP0_PE1MFP_UART3_TXD},
    {NU_PINNAME_BIND(PE_1, UART_3), UART_3, SYS_GPE_MFP0_PE1MFP_UART3_TXD},
    {PE_1, UART_8, SYS_GPE_MFP0_PE1MFP_UART8_TXD},
    {NU_PINNAME_BIND(PE_1, UART_8), UART_8, SYS_GPE_MFP0_PE1MFP_UART8_TXD},
    {PE_3, UART_7, SYS_GPE_MFP0_PE3MFP_UART7_TXD},
    {PE_5, UART_6, SYS_GPE_MFP1_PE5MFP_UART6_TXD},
    {NU_PINNAME_BIND(PE_5, UART_6), UART_6, SYS_GPE_MFP1_PE5MFP_UART6_TXD},
    {PE_5, UART_9, SYS_GPE_MFP1_PE5MFP_UART9_TXD},
    {NU_PINNAME_BIND(PE_5, UART_9), UART_9, SYS_GPE_MFP1_PE5MFP_UART9_TXD},
    {PE_7, UART_5, SYS_GPE_MFP1_PE7MFP_UART5_TXD},
    {PE_8, UART_2, SYS_GPE_MFP2_PE8MFP_UART2_TXD},
    {PE_10, UART_3, SYS_GPE_MFP2_PE10MFP_UART3_TXD},
    {PE_13, UART_1, SYS_GPE_MFP3_PE13MFP_UART1_TXD},
    {PE_14, UART_2, SYS_GPE_MFP3_PE14MFP_UART2_TXD},
    {NU_PINNAME_BIND(PE_14, UART_2), UART_2, SYS_GPE_MFP3_PE14MFP_UART2_TXD},
    {PE_14, UART_6, SYS_GPE_MFP3_PE14MFP_UART6_TXD},
    {NU_PINNAME_BIND(PE_14, UART_6), UART_6, SYS_GPE_MFP3_PE14MFP_UART6_TXD},
    {PF_0, UART_0, SYS_GPF_MFP0_PF0MFP_UART0_TXD},
    {NU_PINNAME_BIND(PF_0, UART_0), UART_0, SYS_GPF_MFP0_PF0MFP_UART0_TXD},
    {PF_0, UART_1, SYS_GPF_MFP0_PF0MFP_UART1_TXD},
    {NU_PINNAME_BIND(PF_0, UART_1), UART_1, SYS_GPF_MFP0_PF0MFP_UART1_TXD},
    {PF_0, UART_2, SYS_GPF_MFP0_PF0MFP_UART2_TXD},
    {NU_PINNAME_BIND(PF_0, UART_2), UART_2, SYS_GPF_MFP0_PF0MFP_UART2_TXD},
    {PF_3, UART_0, SYS_GPF_MFP0_PF3MFP_UART0_TXD},
    {NU_PINNAME_BIND(PF_3, UART_0), UART_0, SYS_GPF_MFP0_PF3MFP_UART0_TXD},
    {PF_3, UART_9, SYS_GPF_MFP0_PF3MFP_UART9_TXD},
    {NU_PINNAME_BIND(PF_3, UART_9), UART_9, SYS_GPF_MFP0_PF3MFP_UART9_TXD},
    {PF_4, UART_2, SYS_GPF_MFP1_PF4MFP_UART2_TXD},
    {PF_7, UART_4, SYS_GPF_MFP1_PF7MFP_UART4_TXD},
    {PF_9, UART_9, SYS_GPF_MFP2_PF9MFP_UART9_TXD},
    {PF_11, UART_5, SYS_GPF_MFP2_PF11MFP_UART5_TXD},
    {PG_0, UART_1, SYS_GPG_MFP0_PG0MFP_UART1_TXD},
    {PG_1, UART_2, SYS_GPG_MFP0_PG1MFP_UART2_TXD},
    {PG_11, UART_7, SYS_GPG_MFP2_PG11MFP_UART7_TXD},
    {PG_13, UART_6, SYS_GPG_MFP3_PG13MFP_UART6_TXD},
    {PH_0, UART_5, SYS_GPH_MFP0_PH0MFP_UART5_TXD},
    {PH_2, UART_4, SYS_GPH_MFP0_PH2MFP_UART4_TXD},
    {PH_4, UART_6, SYS_GPH_MFP1_PH4MFP_UART6_TXD},
    {PH_6, UART_7, SYS_GPH_MFP1_PH6MFP_UART7_TXD},
    {PH_8, UART_1, SYS_GPH_MFP2_PH8MFP_UART1_TXD},
    {PH_10, UART_0, SYS_GPH_MFP2_PH10MFP_UART0_TXD},
    {NU_PINNAME_BIND(PH_10, UART_0), UART_0, SYS_GPH_MFP2_PH10MFP_UART0_TXD},
    {PH_10, UART_4, SYS_GPH_MFP2_PH10MFP_UART4_TXD},
    {NU_PINNAME_BIND(PH_10, UART_4), UART_4, SYS_GPH_MFP2_PH10MFP_UART4_TXD},
    {PH_10, UART_9, SYS_GPH_MFP2_PH10MFP_UART9_TXD},
    {NU_PINNAME_BIND(PH_10, UART_9), UART_9, SYS_GPH_MFP2_PH10MFP_UART9_TXD},
    {PH_12, UART_9, SYS_GPH_MFP3_PH12MFP_UART9_TXD},
    {PI_6, UART_2, SYS_GPI_MFP1_PI6MFP_UART2_TXD},
    {PI_10, UART_2, SYS_GPI_MFP2_PI10MFP_UART2_TXD},
    {PI_12, UART_4, SYS_GPI_MFP3_PI12MFP_UART4_TXD},
    {PI_14, UART_3, SYS_GPI_MFP3_PI14MFP_UART3_TXD},
    {PJ_0, UART_8, SYS_GPJ_MFP0_PJ0MFP_UART8_TXD},
    {PJ_4, UART_8, SYS_GPJ_MFP1_PJ4MFP_UART8_TXD},
    {PJ_8, UART_7, SYS_GPJ_MFP2_PJ8MFP_UART7_TXD},
    {PJ_10, UART_6, SYS_GPJ_MFP2_PJ10MFP_UART6_TXD},

    {NC,    NC,     0}
};

