ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M460/PeripheralPins.c
const PinMap PinMap_UART_RX[] = {
    {PA_0, UART_0, SYS_GPA_MFP0_PA0MFP_UART0_RXD},
    {PA_2, UART_1, SYS_GPA_MFP0_PA2MFP_UART1_RXD},
    {NU_PINNAME_BIND(PA_2, UART_1), UART_1, SYS_GPA_MFP0_PA2MFP_UART1_RXD},
    {PA_2, UART_4, SYS_GPA_MFP0_PA2MFP_UART4_RXD},
    {NU_PINNAME_BIND(PA_2, UART_4), UART_4, SYS_GPA_MFP0_PA2MFP_UART4_RXD},
#if COMPONENT_FPGA_CI_TEST_SHIELD && TARGET_NUMAKER_IOT_M467
    /* Swap the sequence to pass FPGA CI Test Shield tests */
    {PA_4, UART_5, SYS_GPA_MFP1_PA4MFP_UART5_RXD},
    {NU_PINNAME_BIND(PA_4, UART_5), UART_5, SYS_GPA_MFP1_PA4MFP_UART5_RXD},
    {PA_4, UART_0, SYS_GPA_MFP1_PA4MFP_UART0_RXD},
    {NU_PINNAME_BIND(PA_4, UART_0), UART_0, SYS_GPA_MFP1_PA4MFP_UART0_RXD},
#else
    {PA_4, UART_0, SYS_GPA_MFP1_PA4MFP_UART0_RXD},
    {NU_PINNAME_BIND(PA_4, UART_0), UART_0, SYS_GPA_MFP1_PA4MFP_UART0_RXD},
    {PA_4, UART_5, SYS_GPA_MFP1_PA4MFP_UART5_RXD},
    {NU_PINNAME_BIND(PA_4, UART_5), UART_5, SYS_GPA_MFP1_PA4MFP_UART5_RXD},
#endif
    {PA_6, UART_0, SYS_GPA_MFP1_PA6MFP_UART0_RXD},
    {PA_8, UART_1, SYS_GPA_MFP2_PA8MFP_UART1_RXD},
    {NU_PINNAME_BIND(PA_8, UART_1), UART_1, SYS_GPA_MFP2_PA8MFP_UART1_RXD},
    {PA_8, UART_7, SYS_GPA_MFP2_PA8MFP_UART7_RXD},
    {NU_PINNAME_BIND(PA_8, UART_7), UART_7, SYS_GPA_MFP2_PA8MFP_UART7_RXD},
    {PA_10, UART_6, SYS_GPA_MFP2_PA10MFP_UART6_RXD},
    {PA_13, UART_4, SYS_GPA_MFP3_PA13MFP_UART4_RXD},
    {PA_15, UART_0, SYS_GPA_MFP3_PA15MFP_UART0_RXD},
    {PB_0, UART_2, SYS_GPB_MFP0_PB0MFP_UART2_RXD},
    {PB_2, UART_1, SYS_GPB_MFP0_PB2MFP_UART1_RXD},
#if COMPONENT_FPGA_CI_TEST_SHIELD && TARGET_NUMAKER_IOT_M467
    /* Swap the sequence to pass FPGA CI Test Shield tests */
    {PB_4, UART_5, SYS_GPB_MFP1_PB4MFP_UART5_RXD},
    {NU_PINNAME_BIND(PB_4, UART_5), UART_5, SYS_GPB_MFP1_PB4MFP_UART5_RXD},
    {PB_4, UART_2, SYS_GPB_MFP1_PB4MFP_UART2_RXD},
    {NU_PINNAME_BIND(PB_4, UART_2), UART_2, SYS_GPB_MFP1_PB4MFP_UART2_RXD},
#else
    {PB_4, UART_2, SYS_GPB_MFP1_PB4MFP_UART2_RXD},
    {NU_PINNAME_BIND(PB_4, UART_2), UART_2, SYS_GPB_MFP1_PB4MFP_UART2_RXD},
    {PB_4, UART_5, SYS_GPB_MFP1_PB4MFP_UART5_RXD},
    {NU_PINNAME_BIND(PB_4, UART_5), UART_5, SYS_GPB_MFP1_PB4MFP_UART5_RXD},
#endif
    {PB_6, UART_1, SYS_GPB_MFP1_PB6MFP_UART1_RXD},
    {PB_8, UART_0, SYS_GPB_MFP2_PB8MFP_UART0_RXD},
    {NU_PINNAME_BIND(PB_8, UART_0), UART_0, SYS_GPB_MFP2_PB8MFP_UART0_RXD},
    {PB_8, UART_7, SYS_GPB_MFP2_PB8MFP_UART7_RXD},
    {NU_PINNAME_BIND(PB_8, UART_7), UART_7, SYS_GPB_MFP2_PB8MFP_UART7_RXD},
    {PB_10, UART_4, SYS_GPB_MFP2_PB10MFP_UART4_RXD},
    {PB_12, UART_0, SYS_GPB_MFP3_PB12MFP_UART0_RXD},
    {PB_14, UART_3, SYS_GPB_MFP3_PB14MFP_UART3_RXD},
    {PC_0, UART_2, SYS_GPC_MFP0_PC0MFP_UART2_RXD},
    {PC_2, UART_3, SYS_GPC_MFP0_PC2MFP_UART3_RXD},
    {PC_4, UART_2, SYS_GPC_MFP1_PC4MFP_UART2_RXD},
    {NU_PINNAME_BIND(PC_4, UART_2), UART_2, SYS_GPC_MFP1_PC4MFP_UART2_RXD},
    {PC_4, UART_4, SYS_GPC_MFP1_PC4MFP_UART4_RXD},
    {NU_PINNAME_BIND(PC_4, UART_4), UART_4, SYS_GPC_MFP1_PC4MFP_UART4_RXD},
    {PC_6, UART_4, SYS_GPC_MFP1_PC6MFP_UART4_RXD},
    {NU_PINNAME_BIND(PC_6, UART_4), UART_4, SYS_GPC_MFP1_PC6MFP_UART4_RXD},
    {PC_6, UART_6, SYS_GPC_MFP1_PC6MFP_UART6_RXD},
    {NU_PINNAME_BIND(PC_6, UART_6), UART_6, SYS_GPC_MFP1_PC6MFP_UART6_RXD},
    {PC_8, UART_1, SYS_GPC_MFP2_PC8MFP_UART1_RXD},
    {PC_9, UART_3, SYS_GPC_MFP2_PC9MFP_UART3_RXD},
#if COMPONENT_FPGA_CI_TEST_SHIELD && TARGET_NUMAKER_IOT_M467
    /* Swap the sequence to pass FPGA CI Test Shield tests */
    {PC_11, UART_6, SYS_GPC_MFP2_PC11MFP_UART6_RXD},
    {NU_PINNAME_BIND(PC_11, UART_6), UART_6, SYS_GPC_MFP2_PC11MFP_UART6_RXD},
    {PC_11, UART_0, SYS_GPC_MFP2_PC11MFP_UART0_RXD},
    {NU_PINNAME_BIND(PC_11, UART_0), UART_0, SYS_GPC_MFP2_PC11MFP_UART0_RXD},
#else
    {PC_11, UART_0, SYS_GPC_MFP2_PC11MFP_UART0_RXD},
    {NU_PINNAME_BIND(PC_11, UART_0), UART_0, SYS_GPC_MFP2_PC11MFP_UART0_RXD},
    {PC_11, UART_6, SYS_GPC_MFP2_PC11MFP_UART6_RXD},
    {NU_PINNAME_BIND(PC_11, UART_6), UART_6, SYS_GPC_MFP2_PC11MFP_UART6_RXD},
#endif
    {PD_0, UART_3, SYS_GPD_MFP0_PD0MFP_UART3_RXD},
    {PD_2, UART_0, SYS_GPD_MFP0_PD2MFP_UART0_RXD},
    {PD_6, UART_1, SYS_GPD_MFP1_PD6MFP_UART1_RXD},
    {PD_8, UART_7, SYS_GPD_MFP2_PD8MFP_UART7_RXD},
    {PD_10, UART_1, SYS_GPD_MFP2_PD10MFP_UART1_RXD},
    {NU_PINNAME_BIND(PD_10, UART_1), UART_1, SYS_GPD_MFP2_PD10MFP_UART1_RXD},
    {PD_10, UART_8, SYS_GPD_MFP2_PD10MFP_UART8_RXD},
    {NU_PINNAME_BIND(PD_10, UART_8), UART_8, SYS_GPD_MFP2_PD10MFP_UART8_RXD},
    {PD_12, UART_2, SYS_GPD_MFP3_PD12MFP_UART2_RXD},
    {PD_13, UART_6, SYS_GPD_MFP3_PD13MFP_UART6_RXD},
    {PE_0, UART_3, SYS_GPE_MFP0_PE0MFP_UART3_RXD},
    {NU_PINNAME_BIND(PE_0, UART_3), UART_3, SYS_GPE_MFP0_PE0MFP_UART3_RXD},
    {PE_0, UART_8, SYS_GPE_MFP0_PE0MFP_UART8_RXD},
    {NU_PINNAME_BIND(PE_0, UART_8), UART_8, SYS_GPE_MFP0_PE0MFP_UART8_RXD},
    {PE_2, UART_7, SYS_GPE_MFP0_PE2MFP_UART7_RXD},
    {PE_4, UART_6, SYS_GPE_MFP1_PE4MFP_UART6_RXD},
    {NU_PINNAME_BIND(PE_4, UART_6), UART_6, SYS_GPE_MFP1_PE4MFP_UART6_RXD},
    {PE_4, UART_9, SYS_GPE_MFP1_PE4MFP_UART9_RXD},
    {NU_PINNAME_BIND(PE_4, UART_9), UART_9, SYS_GPE_MFP1_PE4MFP_UART9_RXD},
    {PE_6, UART_5, SYS_GPE_MFP1_PE6MFP_UART5_RXD},
    {PE_9, UART_2, SYS_GPE_MFP2_PE9MFP_UART2_RXD},
    {PE_11, UART_3, SYS_GPE_MFP2_PE11MFP_UART3_RXD},
    {PE_15, UART_2, SYS_GPE_MFP3_PE15MFP_UART2_RXD},
    {NU_PINNAME_BIND(PE_15, UART_2), UART_2, SYS_GPE_MFP3_PE15MFP_UART2_RXD},
    {PE_15, UART_6, SYS_GPE_MFP3_PE15MFP_UART6_RXD},
    {NU_PINNAME_BIND(PE_15, UART_6), UART_6, SYS_GPE_MFP3_PE15MFP_UART6_RXD},
    {PF_1, UART_0, SYS_GPF_MFP0_PF1MFP_UART0_RXD},
    {NU_PINNAME_BIND(PF_1, UART_0), UART_0, SYS_GPF_MFP0_PF1MFP_UART0_RXD},
    {PF_1, UART_1, SYS_GPF_MFP0_PF1MFP_UART1_RXD},
    {NU_PINNAME_BIND(PF_1, UART_1), UART_1, SYS_GPF_MFP0_PF1MFP_UART1_RXD},
    {PF_1, UART_2, SYS_GPF_MFP0_PF1MFP_UART2_RXD},
    {NU_PINNAME_BIND(PF_1, UART_2), UART_2, SYS_GPF_MFP0_PF1MFP_UART2_RXD},
    {PF_2, UART_0, SYS_GPF_MFP0_PF2MFP_UART0_RXD},
    {NU_PINNAME_BIND(PF_2, UART_0), UART_0, SYS_GPF_MFP0_PF2MFP_UART0_RXD},
    {PF_2, UART_9, SYS_GPF_MFP0_PF2MFP_UART9_RXD},
    {NU_PINNAME_BIND(PF_2, UART_9), UART_9, SYS_GPF_MFP0_PF2MFP_UART9_RXD},
    {PF_5, UART_2, SYS_GPF_MFP1_PF5MFP_UART2_RXD},
    {PF_6, UART_4, SYS_GPF_MFP1_PF6MFP_UART4_RXD},
    {PF_8, UART_9, SYS_GPF_MFP2_PF8MFP_UART9_RXD},
    {PF_10, UART_5, SYS_GPF_MFP2_PF10MFP_UART5_RXD},
    {PG_0, UART_2, SYS_GPG_MFP0_PG0MFP_UART2_RXD},
    {PG_1, UART_1, SYS_GPG_MFP0_PG1MFP_UART1_RXD},
    {PG_12, UART_7, SYS_GPG_MFP3_PG12MFP_UART7_RXD},
    {PG_14, UART_6, SYS_GPG_MFP3_PG14MFP_UART6_RXD},
    {PH_1, UART_5, SYS_GPH_MFP0_PH1MFP_UART5_RXD},
    {PH_3, UART_4, SYS_GPH_MFP0_PH3MFP_UART4_RXD},
    {PH_5, UART_6, SYS_GPH_MFP1_PH5MFP_UART6_RXD},
    {PH_7, UART_7, SYS_GPH_MFP1_PH7MFP_UART7_RXD},
    {PH_9, UART_1, SYS_GPH_MFP2_PH9MFP_UART1_RXD},
    {PH_11, UART_0, SYS_GPH_MFP2_PH11MFP_UART0_RXD},
    {NU_PINNAME_BIND(PH_11, UART_0), UART_0, SYS_GPH_MFP2_PH11MFP_UART0_RXD},
    {PH_11, UART_4, SYS_GPH_MFP2_PH11MFP_UART4_RXD},
    {NU_PINNAME_BIND(PH_11, UART_4), UART_4, SYS_GPH_MFP2_PH11MFP_UART4_RXD},
    {PH_11, UART_9, SYS_GPH_MFP2_PH11MFP_UART9_RXD},
    {NU_PINNAME_BIND(PH_11, UART_9), UART_9, SYS_GPH_MFP2_PH11MFP_UART9_RXD},
    {PH_13, UART_9, SYS_GPH_MFP3_PH13MFP_UART9_RXD},
    {PI_7, UART_2, SYS_GPI_MFP1_PI7MFP_UART2_RXD},
    {PI_11, UART_2, SYS_GPI_MFP2_PI11MFP_UART2_RXD},
    {PI_13, UART_4, SYS_GPI_MFP3_PI13MFP_UART4_RXD},
    {PI_15, UART_3, SYS_GPI_MFP3_PI15MFP_UART3_RXD},
    {PJ_1, UART_8, SYS_GPJ_MFP0_PJ1MFP_UART8_RXD},
    {PJ_5, UART_8, SYS_GPJ_MFP1_PJ5MFP_UART8_RXD},
    {PJ_9, UART_7, SYS_GPJ_MFP2_PJ9MFP_UART7_RXD},
    {PJ_11, UART_6, SYS_GPJ_MFP2_PJ11MFP_UART6_RXD},

    {NC,    NC,     0}
};

