ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M460/PeripheralPins.c
const PinMap PinMap_UART_RTS[] = {
    {PA_0, UART_1, SYS_GPA_MFP0_PA0MFP_UART1_nRTS},
    {PA_4, UART_0, SYS_GPA_MFP1_PA4MFP_UART0_nRTS},
    {PB_3, UART_5, SYS_GPB_MFP0_PB3MFP_UART5_nRTS},
    {PB_8, UART_1, SYS_GPB_MFP2_PB8MFP_UART1_nRTS},
    {PB_10, UART_0, SYS_GPB_MFP2_PB10MFP_UART0_nRTS},
    {PB_13, UART_3, SYS_GPB_MFP3_PB13MFP_UART3_nRTS},
    {PB_14, UART_0, SYS_GPB_MFP3_PB14MFP_UART0_nRTS},
    {PC_3, UART_2, SYS_GPC_MFP0_PC3MFP_UART2_nRTS},
    {PC_6, UART_0, SYS_GPC_MFP1_PC6MFP_UART0_nRTS},
    {PC_10, UART_6, SYS_GPC_MFP2_PC10MFP_UART6_nRTS},
    {PD_3, UART_3, SYS_GPD_MFP0_PD3MFP_UART3_nRTS},
    {PD_8, UART_2, SYS_GPD_MFP2_PD8MFP_UART2_nRTS},
    {PD_12, UART_8, SYS_GPD_MFP3_PD12MFP_UART8_nRTS},
    {PE_0, UART_4, SYS_GPE_MFP0_PE0MFP_UART4_nRTS},
    {PE_2, UART_8, SYS_GPE_MFP0_PE2MFP_UART8_nRTS},
    {PE_3, UART_6, SYS_GPE_MFP0_PE3MFP_UART6_nRTS},
    {PE_5, UART_7, SYS_GPE_MFP1_PE5MFP_UART7_nRTS},
    {PE_6, UART_9, SYS_GPE_MFP1_PE6MFP_UART9_nRTS},
    {PE_12, UART_1, SYS_GPE_MFP3_PE12MFP_UART1_nRTS},
    {PE_13, UART_4, SYS_GPE_MFP3_PE13MFP_UART4_nRTS},
    {PF_4, UART_2, SYS_GPF_MFP1_PF4MFP_UART2_nRTS},
    {PF_9, UART_5, SYS_GPF_MFP2_PF9MFP_UART5_nRTS},
    {PF_10, UART_9, SYS_GPF_MFP2_PF10MFP_UART9_nRTS},
    {PH_2, UART_5, SYS_GPH_MFP0_PH2MFP_UART5_nRTS},
    {PH_4, UART_7, SYS_GPH_MFP1_PH4MFP_UART7_nRTS},
    {PH_7, UART_9, SYS_GPH_MFP1_PH7MFP_UART9_nRTS},
    {PH_8, UART_3, SYS_GPH_MFP2_PH8MFP_UART3_nRTS},
    {PH_9, UART_9, SYS_GPH_MFP2_PH9MFP_UART9_nRTS},
    {PI_8, UART_2, SYS_GPI_MFP2_PI8MFP_UART2_nRTS},
    {PI_15, UART_8, SYS_GPI_MFP3_PI15MFP_UART8_nRTS},
    {PJ_3, UART_8, SYS_GPJ_MFP0_PJ3MFP_UART8_nRTS},
    {PJ_7, UART_9, SYS_GPJ_MFP1_PJ7MFP_UART9_nRTS},

    {NC,    NC,     0}
};

const PinMap PinMap_UART_CTS[] = {
    {PA_1, UART_1, SYS_GPA_MFP0_PA1MFP_UART1_nCTS},
    {PA_5, UART_0, SYS_GPA_MFP1_PA5MFP_UART0_nCTS},
    {PB_2, UART_5, SYS_GPB_MFP0_PB2MFP_UART5_nCTS},
    {PB_9, UART_1, SYS_GPB_MFP2_PB9MFP_UART1_nCTS},
    {PB_11, UART_0, SYS_GPB_MFP2_PB11MFP_UART0_nCTS},
    {PB_12, UART_3, SYS_GPB_MFP3_PB12MFP_UART3_nCTS},
    {PB_15, UART_0, SYS_GPB_MFP3_PB15MFP_UART0_nCTS},
    {PC_2, UART_2, SYS_GPC_MFP0_PC2MFP_UART2_nCTS},
    {PC_7, UART_0, SYS_GPC_MFP1_PC7MFP_UART0_nCTS},
    {PC_8, UART_4, SYS_GPC_MFP2_PC8MFP_UART4_nCTS},
    {PC_9, UART_6, SYS_GPC_MFP2_PC9MFP_UART6_nCTS},
    {PC_13, UART_8, SYS_GPC_MFP3_PC13MFP_UART8_nCTS},
    {PD_2, UART_3, SYS_GPD_MFP0_PD2MFP_UART3_nCTS},
    {PD_9, UART_2, SYS_GPD_MFP2_PD9MFP_UART2_nCTS},
    {PE_1, UART_4, SYS_GPE_MFP0_PE1MFP_UART4_nCTS},
    {PE_2, UART_6, SYS_GPE_MFP0_PE2MFP_UART6_nCTS},
    {PE_3, UART_8, SYS_GPE_MFP0_PE3MFP_UART8_nCTS},
    {PE_4, UART_7, SYS_GPE_MFP1_PE4MFP_UART7_nCTS},
    {PE_7, UART_9, SYS_GPE_MFP1_PE7MFP_UART9_nCTS},
    {PE_11, UART_1, SYS_GPE_MFP2_PE11MFP_UART1_nCTS},
    {PF_5, UART_2, SYS_GPF_MFP1_PF5MFP_UART2_nCTS},
    {PF_8, UART_5, SYS_GPF_MFP2_PF8MFP_UART5_nCTS},
    {PF_11, UART_9, SYS_GPF_MFP2_PF11MFP_UART9_nCTS},
    {PH_3, UART_5, SYS_GPH_MFP0_PH3MFP_UART5_nCTS},
    {PH_5, UART_7, SYS_GPH_MFP1_PH5MFP_UART7_nCTS},
    {PH_6, UART_9, SYS_GPH_MFP1_PH6MFP_UART9_nCTS},
    {PH_8, UART_9, SYS_GPH_MFP2_PH8MFP_UART9_nCTS},
    {PH_9, UART_3, SYS_GPH_MFP2_PH9MFP_UART3_nCTS},
    {PI_9, UART_2, SYS_GPI_MFP2_PI9MFP_UART2_nCTS},
    {PI_14, UART_8, SYS_GPI_MFP3_PI14MFP_UART8_nCTS},
    {PJ_2, UART_8, SYS_GPJ_MFP0_PJ2MFP_UART8_nCTS},
    {PJ_6, UART_9, SYS_GPJ_MFP1_PJ6MFP_UART9_nCTS},

    {NC,    NC,     0}
};

//*** SPI ***

const PinMap PinMap_SPI_MOSI[] = {
    {PA_0, SPI_11, SYS_GPA_MFP0_PA0MFP_QSPI0_MOSI0},
    {NU_PINNAME_BIND(PA_0, SPI_11), SPI_11, SYS_GPA_MFP0_PA0MFP_QSPI0_MOSI0},
    {PA_0, SPI_0, SYS_GPA_MFP0_PA0MFP_SPI0_MOSI},
    {NU_PINNAME_BIND(PA_0, SPI_0), SPI_0, SYS_GPA_MFP0_PA0MFP_SPI0_MOSI},
    {PA_8, SPI_2, SYS_GPA_MFP2_PA8MFP_SPI2_MOSI},
    {PA_13, SPI_12, SYS_GPA_MFP3_PA13MFP_QSPI1_MOSI0},
    {PA_15, SPI_0, SYS_GPA_MFP3_PA15MFP_SPI0_MOSI},
    {NU_PINNAME_BIND(PA_15, SPI_0), SPI_0, SYS_GPA_MFP3_PA15MFP_SPI0_MOSI},
    {PA_15, SPI_2, SYS_GPA_MFP3_PA15MFP_SPI2_MOSI},
    {NU_PINNAME_BIND(PA_15, SPI_2), SPI_2, SYS_GPA_MFP3_PA15MFP_SPI2_MOSI},
    {PA_15, SPI_10, SYS_GPA_MFP3_PA15MFP_SPI10_MOSI},
    {NU_PINNAME_BIND(PA_15, SPI_10), SPI_10, SYS_GPA_MFP3_PA15MFP_SPI10_MOSI},
#if !(COMPONENT_FPGA_CI_TEST_SHIELD && TARGET_NUMAKER_IOT_M467)
    /* Address SPI among M460HD/M460LD series
     *
     * SPI4~SPI10 are available in M460LD series, but not in M460HD series.
     *
     * For the following reasons, we don't address it except for passing FPGA CI Test Shield tests:
     * 1. Avoid scattered conditional
     * 2. Enable build for both M460HD/M460LD series using the default target name
     */
    {PB_0, SPI_4, SYS_GPB_MFP0_PB0MFP_SPI4_MOSI},
#endif
    {PB_4, SPI_1, SYS_GPB_MFP1_PB4MFP_SPI1_MOSI},
    {PB_6, SPI_3, SYS_GPB_MFP1_PB6MFP_SPI3_MOSI},
    {PB_8, SPI_3, SYS_GPB_MFP2_PB8MFP_SPI3_MOSI},
    {PB_12, SPI_0, SYS_GPB_MFP3_PB12MFP_SPI0_MOSI},
    {PC_0, SPI_11, SYS_GPC_MFP0_PC0MFP_QSPI0_MOSI0},
    {NU_PINNAME_BIND(PC_0, SPI_11), SPI_11, SYS_GPC_MFP0_PC0MFP_QSPI0_MOSI0},
    {PC_0, SPI_7, SYS_GPC_MFP0_PC0MFP_SPI7_MOSI},
    {NU_PINNAME_BIND(PC_0, SPI_7), SPI_7, SYS_GPC_MFP0_PC0MFP_SPI7_MOSI},
    {PC_2, SPI_12, SYS_GPC_MFP0_PC2MFP_QSPI1_MOSI0},
    {NU_PINNAME_BIND(PC_2, SPI_12), SPI_12, SYS_GPC_MFP0_PC2MFP_QSPI1_MOSI0},
    {PC_2, SPI_1, SYS_GPC_MFP0_PC2MFP_SPI1_MOSI},
    {NU_PINNAME_BIND(PC_2, SPI_1), SPI_1, SYS_GPC_MFP0_PC2MFP_SPI1_MOSI},
    {PC_6, SPI_1, SYS_GPC_MFP1_PC6MFP_SPI1_MOSI},
    {NU_PINNAME_BIND(PC_6, SPI_1), SPI_1, SYS_GPC_MFP1_PC6MFP_SPI1_MOSI},
    {PC_6, SPI_6, SYS_GPC_MFP1_PC6MFP_SPI6_MOSI},
    {NU_PINNAME_BIND(PC_6, SPI_6), SPI_6, SYS_GPC_MFP1_PC6MFP_SPI6_MOSI},
    {PC_11, SPI_3, SYS_GPC_MFP2_PC11MFP_SPI3_MOSI},
    {PC_14, SPI_9, SYS_GPC_MFP3_PC14MFP_SPI9_MOSI},
    {PD_0, SPI_0, SYS_GPD_MFP0_PD0MFP_SPI0_MOSI},
    {PD_6, SPI_12, SYS_GPD_MFP1_PD6MFP_QSPI1_MOSI0},
    {NU_PINNAME_BIND(PD_6, SPI_12), SPI_12, SYS_GPD_MFP1_PD6MFP_QSPI1_MOSI0},
    {PD_6, SPI_1, SYS_GPD_MFP1_PD6MFP_SPI1_MOSI},
    {NU_PINNAME_BIND(PD_6, SPI_1), SPI_1, SYS_GPD_MFP1_PD6MFP_SPI1_MOSI},
    {PD_10, SPI_9, SYS_GPD_MFP2_PD10MFP_SPI9_MOSI},
    {PD_13, SPI_12, SYS_GPD_MFP3_PD13MFP_QSPI1_MOSI0},
    {PE_0, SPI_11, SYS_GPE_MFP0_PE0MFP_QSPI0_MOSI0},
    {NU_PINNAME_BIND(PE_0, SPI_11), SPI_11, SYS_GPE_MFP0_PE0MFP_QSPI0_MOSI0},
    {PE_0, SPI_1, SYS_GPE_MFP0_PE0MFP_SPI1_MOSI},
    {NU_PINNAME_BIND(PE_0, SPI_1), SPI_1, SYS_GPE_MFP0_PE0MFP_SPI1_MOSI},
    {PE_2, SPI_3, SYS_GPE_MFP0_PE2MFP_SPI3_MOSI},
    {PE_10, SPI_2, SYS_GPE_MFP2_PE10MFP_SPI2_MOSI},
    {PF_1, SPI_12, SYS_GPF_MFP0_PF1MFP_QSPI1_MOSI0},
    {PF_5, SPI_5, SYS_GPF_MFP1_PF5MFP_SPI5_MOSI},
    {PF_6, SPI_0, SYS_GPF_MFP1_PF6MFP_SPI0_MOSI},
    {PF_11, SPI_2, SYS_GPF_MFP2_PF11MFP_SPI2_MOSI},
    {PG_8, SPI_3, SYS_GPG_MFP2_PG8MFP_SPI3_MOSI},
    {PG_11, SPI_8, SYS_GPG_MFP2_PG11MFP_SPI8_MOSI},
    {PG_14, SPI_12, SYS_GPG_MFP3_PG14MFP_QSPI1_MOSI0},
    {PH_5, SPI_1, SYS_GPH_MFP1_PH5MFP_SPI1_MOSI},
    {PI_8, SPI_1, SYS_GPI_MFP2_PI8MFP_SPI1_MOSI},
    {PJ_1, SPI_11, SYS_GPJ_MFP0_PJ1MFP_QSPI0_MOSI0},
    {PJ_5, SPI_12, SYS_GPJ_MFP1_PJ5MFP_QSPI1_MOSI0},

    {NC,    NC,    0}
};

const PinMap PinMap_SPI_MISO[] = {
    {PA_1, SPI_11, SYS_GPA_MFP0_PA1MFP_QSPI0_MISO0},
    {NU_PINNAME_BIND(PA_1, SPI_11), SPI_11, SYS_GPA_MFP0_PA1MFP_QSPI0_MISO0},
    {PA_1, SPI_0, SYS_GPA_MFP0_PA1MFP_SPI0_MISO},
    {NU_PINNAME_BIND(PA_1, SPI_0), SPI_0, SYS_GPA_MFP0_PA1MFP_SPI0_MISO},
    {PA_9, SPI_2, SYS_GPA_MFP2_PA9MFP_SPI2_MISO},
    {PA_12, SPI_12, SYS_GPA_MFP3_PA12MFP_QSPI1_MISO0},
    {PA_14, SPI_0, SYS_GPA_MFP3_PA14MFP_SPI0_MISO},
    {NU_PINNAME_BIND(PA_14, SPI_0), SPI_0, SYS_GPA_MFP3_PA14MFP_SPI0_MISO},
    {PA_14, SPI_2, SYS_GPA_MFP3_PA14MFP_SPI2_MISO},
    {NU_PINNAME_BIND(PA_14, SPI_2), SPI_2, SYS_GPA_MFP3_PA14MFP_SPI2_MISO},
    {PA_14, SPI_10, SYS_GPA_MFP3_PA14MFP_SPI10_MISO},
    {NU_PINNAME_BIND(PA_14, SPI_10), SPI_10, SYS_GPA_MFP3_PA14MFP_SPI10_MISO},
    {PB_1, SPI_4, SYS_GPB_MFP0_PB1MFP_SPI4_MISO},
    {PB_5, SPI_1, SYS_GPB_MFP1_PB5MFP_SPI1_MISO},
#if !(COMPONENT_FPGA_CI_TEST_SHIELD && TARGET_NUMAKER_IOT_M467)
    /* Address SPI multi-function pin-out difference among M460HD/M460LD series
     *
     * For PB.7, SPI3_MISO is available in M460LD series, but not in M460HD series.
     *
     * For the following reasons, we don't address it except for passing FPGA CI Test Shield tests:
     * 1. Avoid scattered conditional
     * 2. Enable build for both M460HD/M460LD series using the default target name
     */
    {PB_7, SPI_3, SYS_GPB_MFP1_PB7MFP_SPI3_MISO},
#endif
    {PB_9, SPI_3, SYS_GPB_MFP2_PB9MFP_SPI3_MISO},
    {PB_13, SPI_0, SYS_GPB_MFP3_PB13MFP_SPI0_MISO},
    {NU_PINNAME_BIND(PB_13, SPI_0), SPI_0, SYS_GPB_MFP3_PB13MFP_SPI0_MISO},
    {PB_13, SPI_9, SYS_GPB_MFP3_PB13MFP_SPI9_MISO},
    {NU_PINNAME_BIND(PB_13, SPI_9), SPI_9, SYS_GPB_MFP3_PB13MFP_SPI9_MISO},
    {PC_1, SPI_11, SYS_GPC_MFP0_PC1MFP_QSPI0_MISO0},
    {NU_PINNAME_BIND(PC_1, SPI_11), SPI_11, SYS_GPC_MFP0_PC1MFP_QSPI0_MISO0},
    {PC_1, SPI_7, SYS_GPC_MFP0_PC1MFP_SPI7_MISO},
    {NU_PINNAME_BIND(PC_1, SPI_7), SPI_7, SYS_GPC_MFP0_PC1MFP_SPI7_MISO},
    {PC_3, SPI_12, SYS_GPC_MFP0_PC3MFP_QSPI1_MISO0},
    {NU_PINNAME_BIND(PC_3, SPI_12), SPI_12, SYS_GPC_MFP0_PC3MFP_QSPI1_MISO0},
    {PC_3, SPI_1, SYS_GPC_MFP0_PC3MFP_SPI1_MISO},
    {NU_PINNAME_BIND(PC_3, SPI_1), SPI_1, SYS_GPC_MFP0_PC3MFP_SPI1_MISO},
    {PC_7, SPI_1, SYS_GPC_MFP1_PC7MFP_SPI1_MISO},
    {NU_PINNAME_BIND(PC_7, SPI_1), SPI_1, SYS_GPC_MFP1_PC7MFP_SPI1_MISO},
    {PC_7, SPI_6, SYS_GPC_MFP1_PC7MFP_SPI6_MISO},
    {NU_PINNAME_BIND(PC_7, SPI_6), SPI_6, SYS_GPC_MFP1_PC7MFP_SPI6_MISO},
    {PC_12, SPI_3, SYS_GPC_MFP3_PC12MFP_SPI3_MISO},
    {PD_1, SPI_0, SYS_GPD_MFP0_PD1MFP_SPI0_MISO},
    {PD_7, SPI_12, SYS_GPD_MFP1_PD7MFP_QSPI1_MISO0},
    {NU_PINNAME_BIND(PD_7, SPI_12), SPI_12, SYS_GPD_MFP1_PD7MFP_QSPI1_MISO0},
    {PD_7, SPI_1, SYS_GPD_MFP1_PD7MFP_SPI1_MISO},
    {NU_PINNAME_BIND(PD_7, SPI_1), SPI_1, SYS_GPD_MFP1_PD7MFP_SPI1_MISO},
    {PD_11, SPI_9, SYS_GPD_MFP2_PD11MFP_SPI9_MISO},
    {PE_1, SPI_11, SYS_GPE_MFP0_PE1MFP_QSPI0_MISO0},
    {NU_PINNAME_BIND(PE_1, SPI_11), SPI_11, SYS_GPE_MFP0_PE1MFP_QSPI0_MISO0},
    {PE_1, SPI_1, SYS_GPE_MFP0_PE1MFP_SPI1_MISO},
    {NU_PINNAME_BIND(PE_1, SPI_1), SPI_1, SYS_GPE_MFP0_PE1MFP_SPI1_MISO},
    {PE_3, SPI_3, SYS_GPE_MFP0_PE3MFP_SPI3_MISO},
    {PE_9, SPI_2, SYS_GPE_MFP2_PE9MFP_SPI2_MISO},
    {PF_0, SPI_12, SYS_GPF_MFP0_PF0MFP_QSPI1_MISO0},
    {PF_4, SPI_5, SYS_GPF_MFP1_PF4MFP_SPI5_MISO},
    {PF_7, SPI_0, SYS_GPF_MFP1_PF7MFP_SPI0_MISO},
    {PG_4, SPI_2, SYS_GPG_MFP1_PG4MFP_SPI2_MISO},
    {PG_7, SPI_3, SYS_GPG_MFP1_PG7MFP_SPI3_MISO},
    {PG_12, SPI_8, SYS_GPG_MFP3_PG12MFP_SPI8_MISO},
    {PG_13, SPI_12, SYS_GPG_MFP3_PG13MFP_QSPI1_MISO0},
    {PH_4, SPI_1, SYS_GPH_MFP1_PH4MFP_SPI1_MISO},
    {PI_7, SPI_1, SYS_GPI_MFP1_PI7MFP_SPI1_MISO},
    {PJ_0, SPI_11, SYS_GPJ_MFP0_PJ0MFP_QSPI0_MISO0},
    {PJ_4, SPI_12, SYS_GPJ_MFP1_PJ4MFP_QSPI1_MISO0},

    {NC,    NC,    0}
};

