ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M460/PeripheralPins.c
const PinMap PinMap_SPI_SCLK[] = {
    {PA_2, SPI_11, SYS_GPA_MFP0_PA2MFP_QSPI0_CLK},
    {NU_PINNAME_BIND(PA_2, SPI_11), SPI_11, SYS_GPA_MFP0_PA2MFP_QSPI0_CLK},
    {PA_2, SPI_0, SYS_GPA_MFP0_PA2MFP_SPI0_CLK},
    {NU_PINNAME_BIND(PA_2, SPI_0), SPI_0, SYS_GPA_MFP0_PA2MFP_SPI0_CLK},
    {PA_6, SPI_5, SYS_GPA_MFP1_PA6MFP_SPI5_CLK},
    {NU_PINNAME_BIND(PA_6, SPI_5), SPI_5, SYS_GPA_MFP1_PA6MFP_SPI5_CLK},
    {PA_6, SPI_6, SYS_GPA_MFP1_PA6MFP_SPI6_CLK},
    {NU_PINNAME_BIND(PA_6, SPI_6), SPI_6, SYS_GPA_MFP1_PA6MFP_SPI6_CLK},
    {PA_7, SPI_1, SYS_GPA_MFP1_PA7MFP_SPI1_CLK},
    {PA_10, SPI_2, SYS_GPA_MFP2_PA10MFP_SPI2_CLK},
    {PA_13, SPI_0, SYS_GPA_MFP3_PA13MFP_SPI0_CLK},
    {NU_PINNAME_BIND(PA_13, SPI_0), SPI_0, SYS_GPA_MFP3_PA13MFP_SPI0_CLK},
    {PA_13, SPI_2, SYS_GPA_MFP3_PA13MFP_SPI2_CLK},
    {NU_PINNAME_BIND(PA_13, SPI_2), SPI_2, SYS_GPA_MFP3_PA13MFP_SPI2_CLK},
    {PA_13, SPI_10, SYS_GPA_MFP3_PA13MFP_SPI10_CLK},
    {NU_PINNAME_BIND(PA_13, SPI_10), SPI_10, SYS_GPA_MFP3_PA13MFP_SPI10_CLK},
    {PB_2, SPI_4, SYS_GPB_MFP0_PB2MFP_SPI4_CLK},
    {PB_3, SPI_1, SYS_GPB_MFP0_PB3MFP_SPI1_CLK},
    {PB_7, SPI_1, SYS_GPB_MFP1_PB7MFP_SPI1_CLK},
    {PB_11, SPI_3, SYS_GPB_MFP2_PB11MFP_SPI3_CLK},
    {PB_13, SPI_3, SYS_GPB_MFP3_PB13MFP_SPI3_CLK},
    {PB_14, SPI_0, SYS_GPB_MFP3_PB14MFP_SPI0_CLK},
    {PB_15, SPI_9, SYS_GPB_MFP3_PB15MFP_SPI9_CLK},
    {PC_0, SPI_12, SYS_GPC_MFP0_PC0MFP_QSPI1_CLK},
    {PC_1, SPI_1, SYS_GPC_MFP0_PC1MFP_SPI1_CLK},
    {PC_2, SPI_11, SYS_GPC_MFP0_PC2MFP_QSPI0_CLK},
    {NU_PINNAME_BIND(PC_2, SPI_11), SPI_11, SYS_GPC_MFP0_PC2MFP_QSPI0_CLK},
    {PC_2, SPI_7, SYS_GPC_MFP0_PC2MFP_SPI7_CLK},
    {NU_PINNAME_BIND(PC_2, SPI_7), SPI_7, SYS_GPC_MFP0_PC2MFP_SPI7_CLK},
    {PC_4, SPI_12, SYS_GPC_MFP1_PC4MFP_QSPI1_CLK},
    {PC_10, SPI_3, SYS_GPC_MFP2_PC10MFP_SPI3_CLK},
    {PC_14, SPI_11, SYS_GPC_MFP3_PC14MFP_QSPI0_CLK},
    {PD_2, SPI_0, SYS_GPD_MFP0_PD2MFP_SPI0_CLK},
    {PD_5, SPI_1, SYS_GPD_MFP1_PD5MFP_SPI1_CLK},
    {PD_12, SPI_9, SYS_GPD_MFP3_PD12MFP_SPI9_CLK},
    {PE_4, SPI_3, SYS_GPE_MFP1_PE4MFP_SPI3_CLK},
    {PE_8, SPI_2, SYS_GPE_MFP2_PE8MFP_SPI2_CLK},
    {PF_2, SPI_11, SYS_GPF_MFP0_PF2MFP_QSPI0_CLK},
    {PF_6, SPI_5, SYS_GPF_MFP1_PF6MFP_SPI5_CLK},
    {PF_8, SPI_0, SYS_GPF_MFP2_PF8MFP_SPI0_CLK},
    {PG_3, SPI_2, SYS_GPG_MFP0_PG3MFP_SPI2_CLK},
    {PG_6, SPI_3, SYS_GPG_MFP1_PG6MFP_SPI3_CLK},
    {PG_10, SPI_8, SYS_GPG_MFP2_PG10MFP_SPI8_CLK},
    {PG_12, SPI_12, SYS_GPG_MFP3_PG12MFP_QSPI1_CLK},
    {PH_6, SPI_1, SYS_GPH_MFP1_PH6MFP_SPI1_CLK},
    {PH_8, SPI_11, SYS_GPH_MFP2_PH8MFP_QSPI0_CLK},
    {NU_PINNAME_BIND(PH_8, SPI_11), SPI_11, SYS_GPH_MFP2_PH8MFP_QSPI0_CLK},
    {PH_8, SPI_1, SYS_GPH_MFP2_PH8MFP_SPI1_CLK},
    {NU_PINNAME_BIND(PH_8, SPI_1), SPI_1, SYS_GPH_MFP2_PH8MFP_SPI1_CLK},
    {PH_15, SPI_12, SYS_GPH_MFP3_PH15MFP_QSPI1_CLK},
    {PI_9, SPI_1, SYS_GPI_MFP2_PI9MFP_SPI1_CLK},
    {PI_15, SPI_11, SYS_GPI_MFP3_PI15MFP_QSPI0_CLK},
    {PJ_3, SPI_12, SYS_GPJ_MFP0_PJ3MFP_QSPI1_CLK},

    {NC,    NC,    0}
};

const PinMap PinMap_SPI_SSEL[] = {
    {PA_3, SPI_11, SYS_GPA_MFP0_PA3MFP_QSPI0_SS},
    {NU_PINNAME_BIND(PA_3, SPI_11), SPI_11, SYS_GPA_MFP0_PA3MFP_QSPI0_SS},
    {PA_3, SPI_0, SYS_GPA_MFP0_PA3MFP_SPI0_SS},
    {NU_PINNAME_BIND(PA_3, SPI_0), SPI_0, SYS_GPA_MFP0_PA3MFP_SPI0_SS},
    {PA_6, SPI_1, SYS_GPA_MFP1_PA6MFP_SPI1_SS},
    {PA_7, SPI_5, SYS_GPA_MFP1_PA7MFP_SPI5_SS},
    {NU_PINNAME_BIND(PA_7, SPI_5), SPI_5, SYS_GPA_MFP1_PA7MFP_SPI5_SS},
    {PA_7, SPI_6, SYS_GPA_MFP1_PA7MFP_SPI6_SS},
    {NU_PINNAME_BIND(PA_7, SPI_6), SPI_6, SYS_GPA_MFP1_PA7MFP_SPI6_SS},
    {PA_11, SPI_2, SYS_GPA_MFP2_PA11MFP_SPI2_SS},
    {PA_12, SPI_0, SYS_GPA_MFP3_PA12MFP_SPI0_SS},
    {NU_PINNAME_BIND(PA_12, SPI_0), SPI_0, SYS_GPA_MFP3_PA12MFP_SPI0_SS},
    {PA_12, SPI_2, SYS_GPA_MFP3_PA12MFP_SPI2_SS},
    {NU_PINNAME_BIND(PA_12, SPI_2), SPI_2, SYS_GPA_MFP3_PA12MFP_SPI2_SS},
    {PA_12, SPI_10, SYS_GPA_MFP3_PA12MFP_SPI10_SS},
    {NU_PINNAME_BIND(PA_12, SPI_10), SPI_10, SYS_GPA_MFP3_PA12MFP_SPI10_SS},
    {PB_2, SPI_1, SYS_GPB_MFP0_PB2MFP_SPI1_SS},
    {PB_3, SPI_4, SYS_GPB_MFP0_PB3MFP_SPI4_SS},
    {PB_6, SPI_1, SYS_GPB_MFP1_PB6MFP_SPI1_SS},
    {PB_10, SPI_3, SYS_GPB_MFP2_PB10MFP_SPI3_SS},
    {PB_12, SPI_3, SYS_GPB_MFP3_PB12MFP_SPI3_SS},
    {PB_14, SPI_9, SYS_GPB_MFP3_PB14MFP_SPI9_SS},
    {PB_15, SPI_0, SYS_GPB_MFP3_PB15MFP_SPI0_SS},
    {PC_0, SPI_1, SYS_GPC_MFP0_PC0MFP_SPI1_SS},
    {PC_1, SPI_12, SYS_GPC_MFP0_PC1MFP_QSPI1_SS},
    {PC_3, SPI_11, SYS_GPC_MFP0_PC3MFP_QSPI0_SS},
    {NU_PINNAME_BIND(PC_3, SPI_11), SPI_11, SYS_GPC_MFP0_PC3MFP_QSPI0_SS},
    {PC_3, SPI_7, SYS_GPC_MFP0_PC3MFP_SPI7_SS},
    {NU_PINNAME_BIND(PC_3, SPI_7), SPI_7, SYS_GPC_MFP0_PC3MFP_SPI7_SS},
    {PC_5, SPI_12, SYS_GPC_MFP1_PC5MFP_QSPI1_SS},
    {PC_9, SPI_3, SYS_GPC_MFP2_PC9MFP_SPI3_SS},
    {PC_13, SPI_9, SYS_GPC_MFP3_PC13MFP_SPI9_SS},
    {PD_3, SPI_0, SYS_GPD_MFP0_PD3MFP_SPI0_SS},
    {PD_4, SPI_1, SYS_GPD_MFP1_PD4MFP_SPI1_SS},
    {PE_5, SPI_3, SYS_GPE_MFP1_PE5MFP_SPI3_SS},
    {PE_11, SPI_2, SYS_GPE_MFP2_PE11MFP_SPI2_SS},
    {PF_7, SPI_5, SYS_GPF_MFP1_PF7MFP_SPI5_SS},
    {PF_9, SPI_0, SYS_GPF_MFP2_PF9MFP_SPI0_SS},
    {PG_2, SPI_2, SYS_GPG_MFP0_PG2MFP_SPI2_SS},
    {PG_5, SPI_3, SYS_GPG_MFP1_PG5MFP_SPI3_SS},
    {PG_9, SPI_8, SYS_GPG_MFP2_PG9MFP_SPI8_SS},
    {PG_11, SPI_12, SYS_GPG_MFP2_PG11MFP_QSPI1_SS},
    {PH_7, SPI_1, SYS_GPH_MFP1_PH7MFP_SPI1_SS},
    {PH_9, SPI_11, SYS_GPH_MFP2_PH9MFP_QSPI0_SS},
    {NU_PINNAME_BIND(PH_9, SPI_11), SPI_11, SYS_GPH_MFP2_PH9MFP_QSPI0_SS},
    {PH_9, SPI_1, SYS_GPH_MFP2_PH9MFP_SPI1_SS},
    {NU_PINNAME_BIND(PH_9, SPI_1), SPI_1, SYS_GPH_MFP2_PH9MFP_SPI1_SS},
    {PH_14, SPI_12, SYS_GPH_MFP3_PH14MFP_QSPI1_SS},
    {PI_10, SPI_1, SYS_GPI_MFP2_PI10MFP_SPI1_SS},
    {PI_14, SPI_11, SYS_GPI_MFP3_PI14MFP_QSPI0_SS},
    {PJ_2, SPI_12, SYS_GPJ_MFP0_PJ2MFP_QSPI1_SS},

    {NC,    NC,    0}
};

//*** SD ***

const PinMap PinMap_SD_DAT0[] = {
    {PA_0, SD_1, SYS_GPA_MFP0_PA0MFP_SD1_DAT0},
    {PA_8, SD_1, SYS_GPA_MFP2_PA8MFP_SD1_DAT0},
    {PB_2, SD_0, SYS_GPB_MFP0_PB2MFP_SD0_DAT0},
    {PE_2, SD_0, SYS_GPE_MFP0_PE2MFP_SD0_DAT0},
    {PG_12, SD_1, SYS_GPG_MFP3_PG12MFP_SD1_DAT0},
    {PJ_11, SD_1, SYS_GPJ_MFP2_PJ11MFP_SD1_DAT0},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_DAT1[] = {
    {PA_1, SD_1, SYS_GPA_MFP0_PA1MFP_SD1_DAT1},
    {PA_9, SD_1, SYS_GPA_MFP2_PA9MFP_SD1_DAT1},
    {PB_3, SD_0, SYS_GPB_MFP0_PB3MFP_SD0_DAT1},
    {PE_3, SD_0, SYS_GPE_MFP0_PE3MFP_SD0_DAT1},
    {PG_11, SD_1, SYS_GPG_MFP2_PG11MFP_SD1_DAT1},
    {PJ_10, SD_1, SYS_GPJ_MFP2_PJ10MFP_SD1_DAT1},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_DAT2[] = {
    {PA_2, SD_1, SYS_GPA_MFP0_PA2MFP_SD1_DAT2},
    {PA_10, SD_1, SYS_GPA_MFP2_PA10MFP_SD1_DAT2},
    {PB_4, SD_0, SYS_GPB_MFP1_PB4MFP_SD0_DAT2},
    {PE_4, SD_0, SYS_GPE_MFP1_PE4MFP_SD0_DAT2},
    {PG_10, SD_1, SYS_GPG_MFP2_PG10MFP_SD1_DAT2},
    {PJ_9, SD_1, SYS_GPJ_MFP2_PJ9MFP_SD1_DAT2},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_DAT3[] = {
    {PA_3, SD_1, SYS_GPA_MFP0_PA3MFP_SD1_DAT3},
    {PA_11, SD_1, SYS_GPA_MFP2_PA11MFP_SD1_DAT3},
    {PB_5, SD_0, SYS_GPB_MFP1_PB5MFP_SD0_DAT3},
    {PE_5, SD_0, SYS_GPE_MFP1_PE5MFP_SD0_DAT3},
    {PG_9, SD_1, SYS_GPG_MFP2_PG9MFP_SD1_DAT3},
    {PJ_8, SD_1, SYS_GPJ_MFP2_PJ8MFP_SD1_DAT3},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_CMD[] = {
    {PA_5, SD_1, SYS_GPA_MFP1_PA5MFP_SD1_CMD},
    {PB_0, SD_0, SYS_GPB_MFP0_PB0MFP_SD0_CMD},
    {PB_7, SD_1, SYS_GPB_MFP1_PB7MFP_SD1_CMD},
    {PE_7, SD_0, SYS_GPE_MFP1_PE7MFP_SD0_CMD},
    {PG_13, SD_1, SYS_GPG_MFP3_PG13MFP_SD1_CMD},
    {PJ_12, SD_1, SYS_GPJ_MFP3_PJ12MFP_SD1_CMD},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_CLK[] = {
    {PA_4, SD_1, SYS_GPA_MFP1_PA4MFP_SD1_CLK},
    {PB_1, SD_0, SYS_GPB_MFP0_PB1MFP_SD0_CLK},
    {PB_6, SD_1, SYS_GPB_MFP1_PB6MFP_SD1_CLK},
    {PD_13, SD_1, SYS_GPD_MFP3_PD13MFP_SD1_CLK},
    {PE_6, SD_0, SYS_GPE_MFP1_PE6MFP_SD0_CLK},
    {PG_14, SD_1, SYS_GPG_MFP3_PG14MFP_SD1_CLK},
    {PJ_13, SD_1, SYS_GPJ_MFP3_PJ13MFP_SD1_CLK},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_CD[] = {
    {PA_6, SD_1, SYS_GPA_MFP1_PA6MFP_SD1_nCD},
    {PA_12, SD_1, SYS_GPA_MFP3_PA12MFP_SD1_nCD},
    {PB_12, SD_0, SYS_GPB_MFP3_PB12MFP_SD0_nCD},
    {PD_13, SD_0, SYS_GPD_MFP3_PD13MFP_SD0_nCD},
    {PE_14, SD_1, SYS_GPE_MFP3_PE14MFP_SD1_nCD},
    {PG_15, SD_1, SYS_GPG_MFP3_PG15MFP_SD1_nCD},

    {NC,    NC,    0}
};

//*** CAN ***

