ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M460/PeripheralPins.c
const PinMap PinMap_CAN_TD[] = {
    {PA_5, CAN_0, SYS_GPA_MFP1_PA5MFP_CAN0_TXD},
    {PA_12, CAN_0, SYS_GPA_MFP3_PA12MFP_CAN0_TXD},
    {PB_7, CAN_1, SYS_GPB_MFP1_PB7MFP_CAN1_TXD},
    {PB_9, CAN_2, SYS_GPB_MFP2_PB9MFP_CAN2_TXD},
    {PB_11, CAN_0, SYS_GPB_MFP2_PB11MFP_CAN0_TXD},
    {PB_13, CAN_3, SYS_GPB_MFP3_PB13MFP_CAN3_TXD},
    {PC_1, CAN_2, SYS_GPC_MFP0_PC1MFP_CAN2_TXD},
    {PC_3, CAN_1, SYS_GPC_MFP0_PC3MFP_CAN1_TXD},
    {PC_5, CAN_0, SYS_GPC_MFP1_PC5MFP_CAN0_TXD},
    {PC_7, CAN_3, SYS_GPC_MFP1_PC7MFP_CAN3_TXD},
    {PC_10, CAN_1, SYS_GPC_MFP2_PC10MFP_CAN1_TXD},
    {PC_13, CAN_1, SYS_GPC_MFP3_PC13MFP_CAN1_TXD},
    {PD_9, CAN_2, SYS_GPD_MFP2_PD9MFP_CAN2_TXD},
    {PD_11, CAN_0, SYS_GPD_MFP2_PD11MFP_CAN0_TXD},
    {PE_7, CAN_1, SYS_GPE_MFP1_PE7MFP_CAN1_TXD},
    {PE_14, CAN_0, SYS_GPE_MFP3_PE14MFP_CAN0_TXD},
    {PF_0, CAN_2, SYS_GPF_MFP0_PF0MFP_CAN2_TXD},
    {PF_7, CAN_2, SYS_GPF_MFP1_PF7MFP_CAN2_TXD},
    {PF_9, CAN_1, SYS_GPF_MFP2_PF9MFP_CAN1_TXD},
    {PF_11, CAN_3, SYS_GPF_MFP2_PF11MFP_CAN3_TXD},
    {PG_0, CAN_1, SYS_GPG_MFP0_PG0MFP_CAN1_TXD},
    {PH_12, CAN_3, SYS_GPH_MFP3_PH12MFP_CAN3_TXD},
    {PI_6, CAN_3, SYS_GPI_MFP1_PI6MFP_CAN3_TXD},
    {PI_8, CAN_2, SYS_GPI_MFP2_PI8MFP_CAN2_TXD},
    {PI_10, CAN_3, SYS_GPI_MFP2_PI10MFP_CAN3_TXD},
    {PI_12, CAN_0, SYS_GPI_MFP3_PI12MFP_CAN0_TXD},
    {PI_14, CAN_1, SYS_GPI_MFP3_PI14MFP_CAN1_TXD},
    {PJ_0, CAN_2, SYS_GPJ_MFP0_PJ0MFP_CAN2_TXD},
    {PJ_2, CAN_0, SYS_GPJ_MFP0_PJ2MFP_CAN0_TXD},
    {PJ_4, CAN_1, SYS_GPJ_MFP1_PJ4MFP_CAN1_TXD},
    {PJ_6, CAN_2, SYS_GPJ_MFP1_PJ6MFP_CAN2_TXD},
    {PJ_8, CAN_2, SYS_GPJ_MFP2_PJ8MFP_CAN2_TXD},
    {PJ_10, CAN_0, SYS_GPJ_MFP2_PJ10MFP_CAN0_TXD},
    {PJ_12, CAN_1, SYS_GPJ_MFP3_PJ12MFP_CAN1_TXD},

    {NC,    NC,     0}
};

const PinMap PinMap_CAN_RD[] = {
    {PA_4, CAN_0, SYS_GPA_MFP1_PA4MFP_CAN0_RXD},
    {PA_13, CAN_0, SYS_GPA_MFP3_PA13MFP_CAN0_RXD},
    {PB_6, CAN_1, SYS_GPB_MFP1_PB6MFP_CAN1_RXD},
    {PB_8, CAN_2, SYS_GPB_MFP2_PB8MFP_CAN2_RXD},
    {PB_10, CAN_0, SYS_GPB_MFP2_PB10MFP_CAN0_RXD},
    {PB_12, CAN_3, SYS_GPB_MFP3_PB12MFP_CAN3_RXD},
    {PC_0, CAN_2, SYS_GPC_MFP0_PC0MFP_CAN2_RXD},
    {PC_2, CAN_1, SYS_GPC_MFP0_PC2MFP_CAN1_RXD},
    {PC_4, CAN_0, SYS_GPC_MFP1_PC4MFP_CAN0_RXD},
    {PC_6, CAN_3, SYS_GPC_MFP1_PC6MFP_CAN3_RXD},
    {PC_9, CAN_1, SYS_GPC_MFP2_PC9MFP_CAN1_RXD},
    {PD_8, CAN_2, SYS_GPD_MFP2_PD8MFP_CAN2_RXD},
    {PD_10, CAN_0, SYS_GPD_MFP2_PD10MFP_CAN0_RXD},
    {PD_12, CAN_1, SYS_GPD_MFP3_PD12MFP_CAN1_RXD},
    {PE_6, CAN_1, SYS_GPE_MFP1_PE6MFP_CAN1_RXD},
    {PE_15, CAN_0, SYS_GPE_MFP3_PE15MFP_CAN0_RXD},
    {PF_1, CAN_2, SYS_GPF_MFP0_PF1MFP_CAN2_RXD},
    {PF_6, CAN_2, SYS_GPF_MFP1_PF6MFP_CAN2_RXD},
    {PF_8, CAN_1, SYS_GPF_MFP2_PF8MFP_CAN1_RXD},
    {PF_10, CAN_3, SYS_GPF_MFP2_PF10MFP_CAN3_RXD},
    {PG_1, CAN_1, SYS_GPG_MFP0_PG1MFP_CAN1_RXD},
    {PH_13, CAN_3, SYS_GPH_MFP3_PH13MFP_CAN3_RXD},
    {PI_7, CAN_3, SYS_GPI_MFP1_PI7MFP_CAN3_RXD},
    {PI_9, CAN_2, SYS_GPI_MFP2_PI9MFP_CAN2_RXD},
    {PI_11, CAN_3, SYS_GPI_MFP2_PI11MFP_CAN3_RXD},
    {PI_13, CAN_0, SYS_GPI_MFP3_PI13MFP_CAN0_RXD},
    {PI_15, CAN_1, SYS_GPI_MFP3_PI15MFP_CAN1_RXD},
    {PJ_1, CAN_2, SYS_GPJ_MFP0_PJ1MFP_CAN2_RXD},
    {PJ_3, CAN_0, SYS_GPJ_MFP0_PJ3MFP_CAN0_RXD},
    {PJ_5, CAN_1, SYS_GPJ_MFP1_PJ5MFP_CAN1_RXD},
    {PJ_7, CAN_2, SYS_GPJ_MFP1_PJ7MFP_CAN2_RXD},
    {PJ_9, CAN_2, SYS_GPJ_MFP2_PJ9MFP_CAN2_RXD},
    {PJ_11, CAN_0, SYS_GPJ_MFP2_PJ11MFP_CAN0_RXD},
    {PJ_13, CAN_1, SYS_GPJ_MFP3_PJ13MFP_CAN1_RXD},

    {NC,    NC,    0}
};
